{
  "backend/main.mo": "Main Motoko actor implementing meeting session management, user profiles, panic events, audit logging, session recordings, and role-based access control with authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including syntax fixes, SPA structure, glassmorphic login, registration flow, dashboard navigation, and subscription-based feature locking.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including authentication, dashboard layout, visualizers, neural lab, and various UI components with their specific functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point with PWA manifest, favicon, theme color, and Inter font preloading for the AXON SOVEREIGN application.",
  "frontend/public/manifest.json": "PWA manifest defining AXON Remote as a standalone portrait-mode mobile app with icons and black theme.",
  "frontend/src/App.tsx": "Root React component implementing SPA structure with auth/dashboard view toggling, QueryClient provider, and context providers for telemetry and ghost mode.",
  "frontend/src/components/admin/AuditLogViewer.tsx": "Admin component displaying paginated audit logs with action filtering, CSV export functionality, and security event tracking table.",
  "frontend/src/components/admin/SystemHealthMonitor.tsx": "Displays backend system health metrics including cycles balance, heap/stable memory, and query/update call counts with color-coded status indicators and refresh functionality.",
  "frontend/src/components/analytics/BiometricStressRadar.tsx": "Renders a radar chart showing five biometric stress metrics (executive stress, vocal stability, background noise, packet health, privacy score) with simulated real-time updates.",
  "frontend/src/components/analytics/EmotionTracker.tsx": "Displays a stacked area chart tracking seven emotion types (joy, surprise, fear, disgust, anger, sadness, neutral) over time with toggleable legend items.",
  "frontend/src/components/analytics/GlobalNodeMap.tsx": "Visualizes a world map with four global network nodes (San Francisco, London, Tokyo, Bangalore) showing animated pulse effects when nodes become active.",
  "frontend/src/components/analytics/LiveTrafficChart.tsx": "Shows a real-time area chart of network traffic data that updates every 3 seconds with a sliding window of 20 data points.",
  "frontend/src/components/analytics/MeetingLogCard.tsx": "Card component displaying meeting details including title, duration, participant count, sentiment score, cost, and optional summary.",
  "frontend/src/components/analytics/MeetingROITicker.tsx": "Live counter that calculates meeting cost at ₹12.5/second with pause/resume functionality and displays cumulative cost.",
  "frontend/src/components/analytics/NeuralPacketStream.tsx": "Terminal-style log viewer displaying simulated real-time security events across four categories (ENCRYPT, PACKET, NEURAL, QUANTUM) with auto-scrolling.",
  "frontend/src/components/analytics/QuantumEncryptionMonitor.tsx": "Displays a dashboard panel showing quantum encryption metrics including key rotation rate, quantum resistance level, lattice crypto status, and post-quantum readiness score with animated visualizations and color-coded indicators.",
  "frontend/src/components/analytics/RecentFilesTable.tsx": "Renders a table of recent files with columns for name, security level, status, and owner, using color-coded badges to indicate security levels (High/Medium/Low) and file statuses (Active/Archived/Pending).",
  "frontend/src/components/analytics/SentimentRadar.tsx": "Displays a real-time area chart tracking vocal stress and emotional tension metrics over time, updating every 3 seconds with simulated sentiment analysis data.",
  "frontend/src/components/analytics/SpeakerIdentityMatrix.tsx": "Shows a list of speakers with their vocal frequency ranges and activity levels, displaying each speaker with an icon, progress bar, and dynamically updating activity percentages.",
  "frontend/src/components/analytics/SystemAuditTrail.tsx": "Implements a terminal-style scrolling log display showing real-time system events across categories like encryption, authentication, network, and biometric operations with timestamps and auto-scrolling.",
  "frontend/src/components/analytics/ThreatDetectionMatrix.tsx": "Presents a grid matrix of threat detection cells showing attack vectors (Phishing, Malware, DDoS, Zero-Day) across categories (Email, Network, Application, Endpoint) with color-coded severity levels and active threat indicators.",
  "frontend/src/components/analytics/VoicePatternTimeline.tsx": "Displays a timeline visualization of speaker voice patterns with segments showing speaker activity, volume, and timing across a 5-minute period. Includes interactive segment selection and real-time playback indicator.",
  "frontend/src/components/auth/AuthPanel.tsx": "Reusable authentication panel wrapper with tactical glass styling, scanline overlay effects, and AXON logo with click handler. Provides consistent layout for auth forms.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Route guard component that checks session validity using local storage and redirects to login if inactive. Shows loading spinner during authentication check.",
  "frontend/src/components/auth/RegisterView.tsx": "Registration form component with fields for full name, email, password, and password confirmation. Includes password visibility toggles and form validation.",
  "frontend/src/components/auth/RoleProtectedRoute.tsx": "Role-based access control component that verifies user permissions (admin/user) via API and redirects unauthorized users to dashboard. Shows loading state during verification.",
  "frontend/src/components/auth/SignInView.tsx": "Sign-in form with email/password inputs, remember-me checkbox, password visibility toggle, and social login buttons (Google/Facebook). Handles form submission and loading states.",
  "frontend/src/components/auth/ThreeBackground.tsx": "Animated 3D background using Three.js with floating geometric shapes (cubes, spheres, torus) that rotate and float over a gradient backdrop. Provides visual depth for auth pages.",
  "frontend/src/components/common/ActiveStatusIndicator.tsx": "Small status indicator component showing a pulsing green dot with tooltip displaying 'Status: Active'. Used to indicate live/active system status.",
  "frontend/src/components/common/FeatureLockedOverlay.tsx": "Full-screen overlay that blocks access to premium features, displaying upgrade prompt for Shield tier subscription with pricing and navigation to subscriptions page.",
  "frontend/src/components/common/HotkeysReferenceModal.tsx": "Modal component that displays keyboard shortcuts organized by category with search functionality. Opens with '?' key and closes with 'Escape'.",
  "frontend/src/components/common/MetricCard.tsx": "Reusable card component for displaying metrics with an icon, title, value, and optional trend indicator (up/down arrow).",
  "frontend/src/components/common/PrimaryCTA.tsx": "Styled button component with emerald gradient background, hover effects, and shadow animations for primary call-to-action elements.",
  "frontend/src/components/common/SentinelPanicButton.tsx": "Fixed floating panic button that triggers emergency protocol with confirmation dialog, terminates sessions, and navigates to sentinel dashboard.",
  "frontend/src/components/dashboard/ActiveIdentitiesCard.tsx": "Card displaying team members with avatars and roles, allowing admins to revoke access with toast notifications.",
  "frontend/src/components/dashboard/ActivePlanCard.tsx": "Card component showing the current subscription plan (Sovereign Enterprise) with badge and description.",
  "frontend/src/components/dashboard/AssetShieldCard.tsx": "Card displaying protected assets value in INR currency that auto-increments every 2 seconds to simulate real-time updates.",
  "frontend/src/components/dashboard/ControlPanel.tsx": "Card with toggle switches for Neural Shield and Stealth Mode features, persisting state to sessionStorage and logging events via telemetry.",
  "frontend/src/components/dashboard/GlobalNodeMap.tsx": "Animated canvas visualization showing global node locations (NYC, London, Tokyo) with pulsing emerald dots and labels on a dark background.",
  "frontend/src/components/dashboard/KPIMetricsRow.tsx": "Grid of four metric cards displaying secured meetings count, active nodes, threats neutralized (with bar chart), and health score (with radial gauge).",
  "frontend/src/components/dashboard/NeuralIngestInput.tsx": "Card component with URL input and verification button for meeting links. Simulates verification with a 1.5s delay and shows verified state.",
  "frontend/src/components/dashboard/Overview.tsx": "Dashboard overview card displaying system security health (98%) as primary KPI, plus grouped metrics for network stats and team access with trend indicators.",
  "frontend/src/components/dashboard/PricingTable.tsx": "Three-tier pricing table (Free, Sovereign Core ₹299/mo, Global Shield ₹499/mo) with feature lists and subscription management using useSubscriptionTier hook.",
  "frontend/src/components/dashboard/QuantumInterlinkCard.tsx": "Card displaying quantum interlink status with mic standby, 14ms latency, and 12 participants metrics.",
  "frontend/src/components/dashboard/QuickActionsCard.tsx": "Card with ghost mode toggle and tactical exit button that clears session, Internet Identity, and navigates to login.",
  "frontend/src/components/dashboard/SecurityTrafficTrend.tsx": "Card with Recharts line chart showing security traffic volume over the last 7 days with mock data.",
  "frontend/src/components/dashboard/SpectralAnalysisCard.tsx": "Card with animated canvas displaying sine wave spectral analysis visualization with stable signal indicator.",
  "frontend/src/components/dashboard/SynopsisEngineCard.tsx": "Card showing synopsis engine with spinning loader and 'awaiting verified intel link' message.",
  "frontend/src/components/dashboard/TeamManagement.tsx": "Card displaying team members list with active/idle status indicators and revoke access functionality.",
  "frontend/src/components/dashboard/TeamStatusCard.tsx": "Card showing team member names with active/idle status indicators using mock data.",
  "frontend/src/components/dashboard/TelemetryFeed.tsx": "Displays a scrollable feed of telemetry events with color-coded types (success, warning, error) and timestamps, consuming events from TelemetryContext.",
  "frontend/src/components/dashboard/VocalHealthCard.tsx": "Renders a circular progress indicator showing vocal health score (98.4/100) with an SVG gradient ring and \"Digital Twin\" label.",
  "frontend/src/components/dev/PerformanceOverlay.tsx": "Displays a toggleable FPS counter overlay (Ctrl+Shift+F) that measures frame rate using requestAnimationFrame and color-codes performance (green/yellow/red).",
  "frontend/src/components/effects/BorderBeam.tsx": "Renders an animated gradient beam effect that travels diagonally across a component's border using CSS keyframe animations.",
  "frontend/src/components/effects/SovereignOrb.tsx": "Displays a 3D rotating orb with radial gradient, glow effects, and ripple animations on hover for neural core visualization.",
  "frontend/src/components/errors/ErrorBoundary.tsx": "React error boundary component that catches errors and displays a fallback UI with error details and options to retry or return home.",
  "frontend/src/components/layout/BentoCard.tsx": "Wrapper card component with glassmorphism styling and optional BorderBeam animation effect for bento grid layouts.",
  "frontend/src/components/layout/DashboardLayout.tsx": "Main dashboard layout with sidebar navigation, user profile, subscription tier checks, mobile menu, and logout functionality. Includes navigation items for various dashboard sections with tier-based access control.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with four-column grid layout containing brand info, product links, resources, and legal links, plus social media icons in bottom bar.",
  "frontend/src/components/MagneticButton.tsx": "Button component with magnetic attraction effect that follows mouse position with configurable strength and smooth transitions.",
  "frontend/src/components/mobile/BiometricScanner.tsx": "A biometric authentication component supporting fingerprint and face ID scanning modes with animated progress, haptic feedback, and simulated success/error states.",
  "frontend/src/components/neural/AIMirrorStatus.tsx": "Displays the readiness status of an AI voice proxy with visual indicators (checkmark or spinner) and descriptive messages.",
  "frontend/src/components/neural/NeuralProgress.tsx": "A circular progress indicator with SVG gradient rendering that displays synthesis progress percentage.",
  "frontend/src/components/neural/VocalDropZone.tsx": "A drag-and-drop file upload component for audio files that validates file types and displays uploaded audio file details.",
  "frontend/src/components/neural/VoiceHealthDashboard.tsx": "Displays voice quality metrics (pitch stability, clarity index, tone quality) with progress bars and gradient styling.",
  "frontend/src/components/scheduling/SecurityAuditScheduler.tsx": "A calendar-based booking interface for scheduling security audit calls with date selection, time slot picker, and confirmation.",
  "frontend/src/components/security/DarkWebMonitor.tsx": "Monitors and displays dark web threats with filtering by type/severity, auto-generation of threat alerts, and CSV export functionality.",
  "frontend/src/components/sentinel/AcousticMatrixGrid.tsx": "A grid of environment cards (office, jet, airport, etc.) that can be toggled active/inactive for acoustic masking scenarios.",
  "frontend/src/components/sentinel/EnvironmentMixer.tsx": "An audio mixer interface with volume sliders for eight different environmental soundscapes used for tactical audio masking.",
  "frontend/src/components/sentinel/EnvironmentSpoofing.tsx": "Displays a grid of environment audio spoofing options (office, cafe, airport, etc.) with play/stop toggle buttons and visual feedback for the active environment.",
  "frontend/src/components/sentinel/HardwareMimicry.tsx": "Provides buttons to trigger fake OS update screens (Windows 11 and macOS) in fullscreen overlay mode with a close button.",
  "frontend/src/components/sentinel/PacketJitterSimulator.tsx": "Simulates network degradation with a slider to control jitter level, displaying calculated quality, latency, and packet loss metrics, with a Ctrl+Shift+L keyboard shortcut.",
  "frontend/src/components/sentinel/PanicProtocol.tsx": "Displays a fullscreen fake Windows update screen with progress bar and stores panic state in sessionStorage; dismissible via Ctrl+Shift+Q shortcut.",
  "frontend/src/components/settings/BandwidthOptimizer.tsx": "Allows users to select bandwidth quality presets (low/medium/high/ultra) with live bandwidth meter visualization and savings calculation, persisting selection to localStorage.",
  "frontend/src/components/sync/ConnectionLog.tsx": "Displays a scrollable terminal-style log of WebSocket connection events, including authentication, heartbeats, and Diffie-Hellman key exchanges with simulated periodic updates.",
  "frontend/src/components/testimonials/TestimonialCard.tsx": "Renders a testimonial card with avatar, name, title, 5-star rating, and quote text with hover effects.",
  "frontend/src/components/transitions/NeuralScanTransition.tsx": "Displays a fullscreen loading transition with AXON logo, progress bar, and neural scan animation that completes at 100% and calls onComplete callback.",
  "frontend/src/components/transitions/PageTransition.tsx": "Simple wrapper component that applies a fade-in animation to its children for page transitions.",
  "frontend/src/components/vault/IntelSessionCard.tsx": "Displays a meeting log card with collapsible analysis (sentiment, cost) and transcript sections, showing session metadata like duration and participant count.",
  "frontend/src/components/vault/SubscriptionTierCard.tsx": "Displays a subscription tier card with pricing, features list, and selection button. Supports free, core, and shield tiers with monthly/yearly pricing and visual selection state.",
  "frontend/src/components/vault/SubscriptionTiers.tsx": "Manages subscription tier selection (free/core/shield) with monthly/yearly toggle, persists selection to localStorage, and displays three tier cards with feature lists.",
  "frontend/src/components/vault/SubscriptionToggle.tsx": "Toggle switch component for switching between monthly and yearly billing periods with visual highlighting and 20% savings label.",
  "frontend/src/components/video/VideoWelcomeWidget.tsx": "Fixed-position video widget with play/pause, minimize/maximize, and close controls. Shows operator briefing thumbnail with playback simulation.",
  "frontend/src/components/visualizer/NetworkLatencyGlobe.tsx": "3D globe visualization using Three.js showing global network nodes with latency-based color coding and connection arcs between locations.",
  "frontend/src/components/visualizer/NeuralFrequencyVisualizer.tsx": "Canvas-based real-time audio wave visualizer rendering animated sine waves with multiple frequencies and colors.",
  "frontend/src/components/visualizer/WaterfallSpectrogram.tsx": "Canvas-based waterfall spectrogram that scrolls frequency bars downward over time, creating a cascading visualization of audio spectrum.",
  "frontend/src/contexts/GhostModeContext.tsx": "React context providing ghost mode state management with sessionStorage persistence and toggle functionality.",
  "frontend/src/contexts/TelemetryContext.tsx": "React context for logging and managing telemetry events with timestamps, types (info/success/warning/error), and a 50-event history limit.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages backend actor instances with Internet Identity authentication, handling anonymous and authenticated states.",
  "frontend/src/hooks/useHapticFeedback.ts": "Provides a hook for triggering haptic feedback (vibration) on supported devices with light, medium, and heavy intensity presets.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication for ICP, providing a React context and hook for login, logout, identity management, and authentication status tracking.",
  "frontend/src/hooks/useKeyboardShortcut.ts": "Hook that listens for keyboard shortcut combinations and triggers a callback when all specified keys are pressed simultaneously.",
  "frontend/src/hooks/useMousePosition.ts": "Tracks mouse position relative to the center of a referenced HTML element, returning normalized x/y coordinates.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, roles, meeting logs, panic events, audit logs, session recordings, and system health metrics.",
  "frontend/src/hooks/useSubscriptionTier.ts": "Manages subscription tier state (free/core/shield) with feature flags and localStorage persistence, providing tier-based access control for features like Neural Lab and Sentinel Protocol.",
  "frontend/src/index.css": "Defines global Tailwind CSS configuration with custom CSS variables for theming (dark sidebar, light content), tactical glass effects, scanlines animations, and utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard with tabs for user management, audit logs, and system health monitoring, displaying current user profile and role information.",
  "frontend/src/pages/AnalyticsVault.tsx": "Displays archived meeting logs in a grid layout with subscription tier information, showing loading states and empty states when no sessions exist.",
  "frontend/src/pages/CommandCenter.tsx": "Main dashboard page that displays KPI cards (QuantumInterlink, AssetShield, VocalHealth, QuickActions), a NeuralIngestInput component, and conditionally renders SpectralAnalysisCard based on subscription tier.",
  "frontend/src/pages/DeviceSync.tsx": "Device synchronization page that displays a QR code for mobile pairing and a connection log in a two-column bento grid layout.",
  "frontend/src/pages/DevMetrics.tsx": "Developer metrics dashboard displaying system health data including cycles balance, heap/stable memory usage with charts, and critical threshold alerts using Recharts for visualization.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, feature grid showcasing security capabilities (Sentinel Protocol, Quantum Encryption, Neural Network, etc.), testimonials, and social media links.",
  "frontend/src/pages/LoginPage.tsx": "Authentication page with sign-in/register views, form validation, loading states, and a hidden master bypass feature activated by triple-clicking the logo.",
  "frontend/src/pages/MobileBiometric.tsx": "Mobile-specific biometric authentication page with a back button and BiometricScanner component.",
  "frontend/src/pages/NeuralLab.tsx": "Voice cloning interface with persona specification textarea, vocal sample upload, neural synthesis progress tracking, voice health dashboard, and AI mirror status display.",
  "frontend/src/pages/SentinelProtocol.tsx": "Tactical countermeasures page featuring acoustic matrix, emergency panic button, environment mixer/spoofing, packet jitter simulator, and hardware mimicry controls, gated by subscription tier.",
  "frontend/src/pages/Settings.tsx": "Settings page containing the BandwidthOptimizer component for performance configuration.",
  "frontend/src/pages/SignupPage.tsx": "Empty file with no content.",
  "frontend/src/pages/Subscriptions.tsx": "Displays pricing tiers (Basic ₹299/month and Premium ₹499/month) with feature lists and subscription buttons that show toast notifications for simulated payment flow.",
  "frontend/src/pages/TacticalRemote.tsx": "Mobile command interface with large tactile buttons for panic mode, lag simulation, environment spoofing, and biometric scanning, using haptic feedback and toast notifications.",
  "frontend/src/pages/TeamManagementPage.tsx": "Simple team management page that displays a header and renders the ActiveIdentitiesCard component for managing team members and access levels.",
  "frontend/src/pages/UnifiedDashboard.tsx": "Main dashboard with sidebar navigation, user profile display, subscription tier badges, and sections for command center, neural lab, sentinel protocol, device sync, and vault features.",
  "frontend/src/utils/localStorageAuth.ts": "Provides localStorage-based authentication with basic encryption/decryption, user registration, sign-in validation, and session management using keys like AXON_USERS, AXON_SESSION, and AXON_MASTER_USER.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode support, custom color palette using OKLCH color space (including sidebar, chart, and semantic colors), extended theme with custom animations (accordion), and typography/container-queries plugins.",
  "project_state.json": "Project state document for AXON SOVEREIGN SPA application defining architecture (auth/dashboard views, localStorage user data, glassmorphic design), features (5 dashboard sections, 3-tier subscription, waveform visualization, KPIs), and known syntax error issues causing blank screen."
}