{
  "backend/main.mo": "Main Motoko actor implementing meeting session management, user profiles, panic events, audit logging, session recordings, and role-based access control with authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting the removal of PricingTable component from CommandCenter dashboard page.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, hooks, pages, components, and authentication flows.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, including sidebar, chart, and color scheme definitions.",
  "frontend/index.html": "HTML entry point with PWA manifest, favicon, Inter font preload, and root div for React mounting.",
  "frontend/public/manifest.json": "PWA manifest defining AXON Remote as a standalone portrait mobile app with icons and theme colors.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes, React Query client, telemetry provider, and protected dashboard layout.",
  "frontend/src/components/admin/AuditLogViewer.tsx": "Admin component displaying paginated audit logs with filtering by action type and CSV export functionality.",
  "frontend/src/components/admin/SystemHealthMonitor.tsx": "Displays backend system health metrics including cycles balance, heap/stable memory, and query/update call counts with color-coded status indicators and critical threshold alerts.",
  "frontend/src/components/analytics/BiometricStressRadar.tsx": "Renders a radar chart visualizing five biometric stress metrics (executive stress, vocal stability, background noise, packet health, privacy score) with simulated real-time updates.",
  "frontend/src/components/analytics/EmotionTracker.tsx": "Displays a stacked area chart tracking seven emotion types over time with toggleable legend items and simulated real-time emotion data generation.",
  "frontend/src/components/analytics/GlobalNodeMap.tsx": "Visualizes a simplified world map with animated node pulses representing distributed network activity across four global locations (San Francisco, London, Tokyo, Bangalore).",
  "frontend/src/components/analytics/LiveTrafficChart.tsx": "Shows a real-time area chart of network traffic with auto-updating data points that scroll horizontally as new traffic values are generated every 3 seconds.",
  "frontend/src/components/analytics/MeetingLogCard.tsx": "Displays a card component showing meeting details including title, duration, participant count, sentiment score, cost, and optional summary with encryption indicator.",
  "frontend/src/components/analytics/MeetingROITicker.tsx": "Shows a live-updating cost tracker that increments at ₹12.5/second with pause/resume functionality to simulate meeting ROI calculation.",
  "frontend/src/components/analytics/NeuralPacketStream.tsx": "Renders a terminal-style scrolling log display showing simulated real-time security events across four categories (ENCRYPT, PACKET, NEURAL, QUANTUM) with timestamps.",
  "frontend/src/components/analytics/QuantumEncryptionMonitor.tsx": "Displays a dashboard panel showing quantum encryption metrics including key rotation rate, quantum resistance level, lattice crypto status, and post-quantum readiness score with animated indicators and color-coded status displays.",
  "frontend/src/components/analytics/RecentFilesTable.tsx": "Renders a table component displaying recent files with columns for name, security level, status, and owner, using color-coded badges to indicate different security levels and file statuses.",
  "frontend/src/components/analytics/SentimentRadar.tsx": "Displays a live-updating area chart tracking vocal stress and emotional tension metrics over time, with data points refreshing every 3 seconds to show sentiment analysis trends.",
  "frontend/src/components/analytics/SpeakerIdentityMatrix.tsx": "Shows a list of speakers with their vocal frequency ranges and activity levels, displaying each speaker with an avatar, progress bar, and dynamically updating activity percentages.",
  "frontend/src/components/analytics/SystemAuditTrail.tsx": "Implements a terminal-style scrolling log display showing real-time system security events across categories like encryption, authentication, network, and biometrics with timestamps and auto-scrolling functionality.",
  "frontend/src/components/analytics/ThreatDetectionMatrix.tsx": "Displays a grid matrix of threat detection cells showing attack vectors (phishing, malware, DDoS, zero-day) across different categories with color-coded severity levels and active threat indicators that update every 5 seconds.",
  "frontend/src/components/analytics/VoicePatternTimeline.tsx": "Displays a timeline visualization of speaker voice patterns with segments showing speaker activity, duration, and volume over a 5-minute period. Includes real-time playback indicator and interactive segment selection with hover effects.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Wraps routes requiring authentication, checking for Internet Identity and AXON_SESSION in localStorage. Redirects to login if unauthenticated and shows a loading spinner during initialization.",
  "frontend/src/components/auth/RoleProtectedRoute.tsx": "Enforces role-based access control by verifying user role (admin or user) via backend query. Redirects to dashboard with error toast if user lacks required permissions.",
  "frontend/src/components/common/ActiveStatusIndicator.tsx": "Renders a pulsing green dot with tooltip indicating active status. Uses shadcn/ui Tooltip component for hover interaction.",
  "frontend/src/components/common/HotkeysReferenceModal.tsx": "Modal displaying categorized keyboard shortcuts with search functionality. Opens with '?' key and organizes shortcuts into collapsible accordion sections by category.",
  "frontend/src/components/common/MetricCard.tsx": "Reusable card component displaying a metric with title, value, icon, and optional trend indicator (up/down arrow). Features emerald-themed hover effects.",
  "frontend/src/components/common/PrimaryCTA.tsx": "Styled button component with emerald gradient background, shadow effects, and hover animations. Wraps shadcn/ui Button with preset styling for primary call-to-action use.",
  "frontend/src/components/dashboard/ActiveIdentitiesCard.tsx": "Displays list of team members with avatars, roles, and revoke access buttons. Manages local state for member list and shows success toast on revocation.",
  "frontend/src/components/dashboard/ActivePlanCard.tsx": "Shows current subscription plan (Sovereign Enterprise) with crown icon and badge. Static display card with emerald-themed styling.",
  "frontend/src/components/dashboard/ControlPanel.tsx": "Provides toggle switches for Neural Shield and Stealth Mode security features. Persists state to sessionStorage and logs events via telemetry context.",
  "frontend/src/components/dashboard/GlobalNodeMap.tsx": "Animated canvas visualization showing global node locations (NYC, London, Tokyo) with pulsing emerald dots and glow effects. Uses requestAnimationFrame for smooth animation loop.",
  "frontend/src/components/dashboard/KPIMetricsRow.tsx": "Displays four KPI metric cards in a responsive grid: Total Secured Meetings, Active Global Nodes, Threats Neutralized (with bar chart), and Sovereign Health Score (with radial gauge).",
  "frontend/src/components/dashboard/Overview.tsx": "Shows a system overview card with a primary Security Health KPI (98%) and grouped metrics for Network Stats (Active Sessions, Neural Efficiency) and User/Team Access (Team Members, Threats).",
  "frontend/src/components/dashboard/PricingTable.tsx": "Renders two pricing tier cards (Basic at $299/month and Premium at $499/month) with feature lists and subscribe buttons.",
  "frontend/src/components/dashboard/SecurityTrafficTrend.tsx": "Displays a line chart showing security traffic volume trends over the last 7 days using Recharts.",
  "frontend/src/components/dashboard/TeamManagement.tsx": "Provides a team member list with status indicators and revoke access functionality, showing toast notifications on member removal.",
  "frontend/src/components/dashboard/TeamStatusCard.tsx": "Shows a simple card listing team members with their active/idle status indicated by colored dots.",
  "frontend/src/components/dashboard/TelemetryFeed.tsx": "Displays a scrollable feed of telemetry events from TelemetryContext with timestamps and color-coded event types (success, warning, error).",
  "frontend/src/components/dev/PerformanceOverlay.tsx": "Shows a toggleable FPS counter overlay (Ctrl+Shift+F) that measures and displays real-time frame rate with color-coded performance indicators.",
  "frontend/src/components/effects/BorderBeam.tsx": "Renders an animated gradient border beam effect that moves diagonally across a component using CSS animations.",
  "frontend/src/components/effects/SovereignOrb.tsx": "Renders an animated 3D orb with radial gradient, rotation animation, and hover-triggered ripple effects. Includes inline keyframe animations for rotation and ripple expansion.",
  "frontend/src/components/errors/ErrorBoundary.tsx": "React class component that catches errors in child components and displays a styled error card with retry and home navigation options. Logs errors to console and supports custom fallback UI.",
  "frontend/src/components/layout/BentoCard.tsx": "Wrapper component that renders a styled Card with optional BorderBeam effect, using backdrop blur and semi-transparent styling. Accepts children, className, and showBeam props.",
  "frontend/src/components/layout/DashboardLayout.tsx": "Main dashboard layout with collapsible sidebar navigation, user profile display, and logout functionality. Includes navigation items for dashboard, security, team management, pricing, and settings with active state highlighting.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with four-column grid layout displaying brand info, product links, resources, and legal links. Includes social media icons and copyright information.",
  "frontend/src/components/MagneticButton.tsx": "Button component with magnetic hover effect that translates based on mouse position relative to the button.",
  "frontend/src/components/mobile/BiometricScanner.tsx": "Interactive biometric scanner component supporting fingerprint and face ID modes with animated scanning progress, haptic feedback, and success/error states. Simulates 2.5-second scan with 80% success rate.",
  "frontend/src/components/neural/AIMirrorStatus.tsx": "Displays AI neural proxy status with conditional rendering showing either ready state (green checkmark) or standby state (loading spinner). Provides user feedback on AI voice twin activation status.",
  "frontend/src/components/neural/NeuralProgress.tsx": "Circular progress indicator using SVG with gradient stroke that animates based on progress percentage. Displays numeric progress value and 'Synthesizing' label in center.",
  "frontend/src/components/neural/VocalDropZone.tsx": "Drag-and-drop file upload zone for audio files with visual feedback on drag state. Filters for audio file types and displays uploaded files with metadata (name, size).",
  "frontend/src/components/neural/VoiceHealthDashboard.tsx": "Dashboard displaying three voice quality metrics (Pitch Stability, Clarity Index, Tone Quality) with percentage values, icons, and gradient progress bars. Uses grid layout for responsive display.",
  "frontend/src/components/scheduling/SecurityAuditScheduler.tsx": "A React component for scheduling security audit calls with date picker (excluding weekends) and time slot selection, displaying confirmation via toast notifications.",
  "frontend/src/components/security/DarkWebMonitor.tsx": "Monitors and displays dark web threats with filtering by type and severity, generates simulated threats periodically, and exports threat reports as CSV files.",
  "frontend/src/components/sentinel/EnvironmentMixer.tsx": "An audio environment mixer component with volume sliders for 8 different ambient soundscapes (office, rain, cafe, etc.) for tactical audio masking.",
  "frontend/src/components/sentinel/EnvironmentSpoofing.tsx": "Displays a grid of 16 environment audio spoofing options with play/stop controls, allowing users to activate background audio for different locations.",
  "frontend/src/components/sentinel/HardwareMimicry.tsx": "Displays fake OS update screens (Windows 11 or macOS) in fullscreen mode to mimic system updates for privacy/security purposes.",
  "frontend/src/components/sentinel/PacketJitterSimulator.tsx": "Simulates network packet jitter with a slider control, displaying quality degradation, latency, and packet loss metrics, with Ctrl+Shift+L hotkey support.",
  "frontend/src/components/sentinel/PanicProtocol.tsx": "Displays a fullscreen fake Windows update screen as a panic protocol, with animated progress bar and hidden Ctrl+Shift+Q shortcut to dismiss.",
  "frontend/src/components/settings/BandwidthOptimizer.tsx": "Allows users to select bandwidth quality presets (low/medium/high/ultra) with live bandwidth usage meter and savings calculations, persisting selection to localStorage.",
  "frontend/src/components/sync/ConnectionLog.tsx": "Displays a scrollable terminal-style log of WebSocket connection events with timestamps, simulating periodic heartbeat and sync messages.",
  "frontend/src/components/testimonials/TestimonialCard.tsx": "Renders a testimonial card with avatar, name, title, 5-star rating, and quote text with hover effects.",
  "frontend/src/components/transitions/NeuralScanTransition.tsx": "Full-screen transition component showing AXON logo with animated progress bar and scan line effect, calls onComplete when finished.",
  "frontend/src/components/transitions/PageTransition.tsx": "Simple wrapper component that applies a fade-in animation to its children.",
  "frontend/src/components/video/VideoWelcomeWidget.tsx": "Fixed-position video widget with play/pause controls, minimize/maximize, and close functionality, displaying an operator briefing thumbnail.",
  "frontend/src/components/visualizer/NetworkLatencyGlobe.tsx": "3D globe visualization using Three.js showing global network nodes with color-coded latency indicators and animated connection arcs.",
  "frontend/src/components/visualizer/NeuralFrequencyVisualizer.tsx": "Canvas-based audio wave visualizer rendering animated sine waves in blue and purple to simulate real-time frequency analysis.",
  "frontend/src/components/visualizer/WaterfallSpectrogram.tsx": "Canvas-based waterfall spectrogram that scrolls frequency bars downward, creating a cascading visualization of audio spectrum data.",
  "frontend/src/contexts/GhostModeContext.tsx": "React context provider managing ghost mode state with sessionStorage persistence and toggle functionality.",
  "frontend/src/contexts/TelemetryContext.tsx": "React context provider for logging and managing telemetry events with timestamps, types, and a 50-event limit.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages backend actor instances with Internet Identity authentication and admin token initialization.",
  "frontend/src/hooks/useHapticFeedback.ts": "Custom hook providing haptic feedback utilities with light, medium, and heavy vibration patterns using the Vibration API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useKeyboardShortcut.ts": "Custom React hook that listens for keyboard shortcuts by tracking pressed keys and triggering callbacks when specified key combinations are detected.",
  "frontend/src/hooks/useMousePosition.ts": "Custom React hook that tracks mouse position relative to the center of a referenced HTML element.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including user profiles, roles, meeting logs, panic events, audit logs, session recordings, and system health metrics.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (dark blue sidebar, light background), utility classes for ghost mode blur, and keyframe animations for fade-in, scan lines, and pulse effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page with tabs for user management, audit logs, and system health monitoring, displaying current user profile and role information.",
  "frontend/src/pages/AnalyticsVault.tsx": "Displays a grid of encrypted meeting logs and intelligence reports, showing loading skeletons or empty state when no meetings exist.",
  "frontend/src/pages/CommandCenter.tsx": "Main dashboard page displaying KPI metrics, security traffic trends, active identities, and a control panel in a responsive grid layout.",
  "frontend/src/pages/DeviceSync.tsx": "Device synchronization page that displays a QR code for mobile pairing and a connection log, allowing users to pair mobile devices for remote control.",
  "frontend/src/pages/DevMetrics.tsx": "Developer metrics page showing system health data including cycles balance, heap/stable memory usage with historical charts, and critical threshold alerts.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, security features showcase, testimonials, and CTAs to drive users to login/signup for the AXON platform.",
  "frontend/src/pages/LoginPage.tsx": "Authentication page offering Google sign-up and Internet Identity login options, managing session state and redirecting authenticated users to the command center.",
  "frontend/src/pages/MobileBiometric.tsx": "Mobile-optimized biometric authentication page with a back button and BiometricScanner component for fingerprint/face verification.",
  "frontend/src/pages/NeuralLab.tsx": "Voice cloning interface with vocal sample upload, neural synthesis controls, progress tracking, voice health dashboard, and AI mirror status display.",
  "frontend/src/pages/SentinelProtocol.tsx": "Security countermeasures dashboard featuring emergency panic mode, environment spoofing, packet jitter simulation, hardware mimicry, and environment mixing controls.",
  "frontend/src/pages/Settings.tsx": "Performance settings page containing bandwidth optimization controls for system tuning.",
  "frontend/src/pages/SignupPage.tsx": "Empty signup page component (no implementation present).",
  "frontend/src/pages/Subscriptions.tsx": "Pricing page displaying Basic (₹299/month) and Premium (₹499/month) subscription tiers with feature lists and simulated subscription flow.",
  "frontend/src/pages/TacticalRemote.tsx": "Mobile tactical control interface with large touch buttons for panic mode, lag simulation, environment spoofing, and biometric authentication with haptic feedback.",
  "frontend/src/pages/TeamManagementPage.tsx": "React page component that renders a team management interface with a title, description, and an ActiveIdentitiesCard component for managing team members and access levels.",
  "frontend/src/utils/localStorageAuth.ts": "Empty file with no content.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to extract, store, and manage URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, extended theme settings including container queries, typography, animations, and custom design tokens for UI components.",
  "project_state.json": "Project metadata file tracking feature requests and architectural state, currently documenting a pending request to remove Basic ($299) and Premium ($499) pricing plans from the dashboard."
}