{
  "backend/main.mo": "Main Motoko actor implementing meeting intelligence backend with role-based access control, user profiles, meeting logs, panic events, audit logging, session recordings, and system health metrics; includes authorization mixin and comprehensive CRUD operations with permission checks.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: removal of 3-tier pricing from landing page, creation of Subscriptions page with dashboard navigation, implementation of Basic (₹300/month) and Premium (₹500/month) pricing tiers with glassmorphism styling, feature differentiation between tiers, and Subscribe CTA buttons with simulated payment flow.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including routing configuration, React Query hooks, custom hooks for keyboard shortcuts and haptic feedback, page components (landing, login, signup, dashboard), layout components with glassmorphic sidebar, visualizers, analytics components, and UI utilities.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color tokens for background, foreground, card, popover, primary, secondary, muted, accent, destructive, border, input, ring, charts, and sidebar components using OKLCH color space.",
  "frontend/index.html": "HTML entry point for AXON application with favicon, viewport meta tags, theme color, manifest link, and root div for React mounting.",
  "frontend/public/manifest.json": "PWA manifest for AXON Remote mobile app defining standalone display mode, portrait orientation, black theme, and icon assets at 192x192 and 512x512 resolutions.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for landing, auth, dashboard pages (command center, neural lab, sentinel, device sync, analytics, subscriptions, admin panel, dev metrics, settings), protected routes with role-based access, theme provider, toast notifications, panic protocol, hotkeys modal, and ghost mode context.",
  "frontend/src/components/admin/AuditLogViewer.tsx": "Displays a paginated, filterable table of audit logs with action types, timestamps, users, and success status; includes CSV export functionality.",
  "frontend/src/components/admin/SystemHealthMonitor.tsx": "Monitors and displays backend system health metrics including cycles balance, heap/stable memory usage, and query/update call counts with visual indicators and alerts for critical thresholds.",
  "frontend/src/components/analytics/BiometricStressRadar.tsx": "Renders a radar chart displaying five biometric health metrics (executive stress, vocal stability, background noise, packet health, privacy score) with simulated real-time updates.",
  "frontend/src/components/analytics/EmotionTracker.tsx": "Displays a stacked area chart tracking seven emotion types over time with toggleable legend items and simulated real-time emotion data generation.",
  "frontend/src/components/analytics/GlobalNodeMap.tsx": "Visualizes a simplified world map with four global node locations (San Francisco, London, Tokyo, Bangalore) showing animated pulse effects for simulated network activity.",
  "frontend/src/components/analytics/MeetingLogCard.tsx": "Displays a card with meeting details including title, duration, participant count, sentiment score, cost, and optional summary text.",
  "frontend/src/components/analytics/MeetingROITicker.tsx": "Shows a live-updating cost ticker that increments at ₹12.5/second with pause/resume controls to track meeting ROI in real-time.",
  "frontend/src/components/analytics/NeuralPacketStream.tsx": "Displays a real-time scrolling log of simulated security events (encryption, packet, neural, quantum categories) that updates every 2-3 seconds with random messages and timestamps.",
  "frontend/src/components/analytics/QuantumEncryptionMonitor.tsx": "Shows quantum encryption metrics including key rotation rate, quantum resistance level, lattice crypto status, and post-quantum readiness score with periodic random updates.",
  "frontend/src/components/analytics/SentimentRadar.tsx": "Renders an area chart tracking simulated vocal stress and emotional tension metrics over time, updating every 3 seconds with new data points.",
  "frontend/src/components/analytics/SpeakerIdentityMatrix.tsx": "Displays a list of speakers with their vocal frequency ranges and activity levels shown as progress bars that update periodically with random fluctuations.",
  "frontend/src/components/analytics/SystemAuditTrail.tsx": "Shows a scrolling terminal-style log of system security events across categories like encryption, authentication, network, and biometric checks with timestamps.",
  "frontend/src/components/analytics/ThreatDetectionMatrix.tsx": "Displays a grid of threat detection cells showing attack vectors (phishing, malware, DDoS, zero-day) across categories with color-coded severity levels and counts.",
  "frontend/src/components/analytics/VoicePatternTimeline.tsx": "Visualizes speaker activity over a 5-minute timeline with colored segments representing each speaker's vocal patterns, volume, and duration with interactive hover states.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "A route guard component that checks Internet Identity authentication status and redirects unauthenticated users to login, showing loading states during initialization and authentication.",
  "frontend/src/components/auth/RoleProtectedRoute.tsx": "A role-based access control component that verifies user permissions (admin or user) and redirects unauthorized users to the dashboard with error notifications.",
  "frontend/src/components/common/ActiveStatusIndicator.tsx": "A visual indicator component displaying an animated green dot with a tooltip to show active status.",
  "frontend/src/components/common/HotkeysReferenceModal.tsx": "A modal dialog that displays categorized keyboard shortcuts with search functionality, triggered by the '?' key and organized in an accordion layout.",
  "frontend/src/components/common/PrimaryCTA.tsx": "A styled primary call-to-action button component with gradient background, hover effects, and animation transitions.",
  "frontend/src/components/dev/PerformanceOverlay.tsx": "A development overlay that displays real-time FPS counter with color-coded performance indicators, toggled via Ctrl+Shift+F and persisted in localStorage.",
  "frontend/src/components/effects/BorderBeam.tsx": "A decorative animated border effect component that creates a moving gradient beam along the edges of its container.",
  "frontend/src/components/effects/SovereignOrb.tsx": "An animated 3D orb visualization with rotating gradient effects and ripple animations on hover, representing a neural core.",
  "frontend/src/components/errors/ErrorBoundary.tsx": "A React error boundary class component that catches rendering errors and displays a fallback UI with error details and recovery options.",
  "frontend/src/components/layout/BentoCard.tsx": "A card wrapper component with glassmorphism styling and optional animated border beam effect for bento grid layouts.",
  "frontend/src/components/layout/DashboardLayout.tsx": "The main dashboard layout component with collapsible sidebar navigation, role-based menu items, ghost mode toggle, user profile display, and mobile responsive drawer.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with brand logo, navigation links organized into Product/Resources/Legal columns, and social media icons. Uses TanStack Router for internal navigation and displays copyright information.",
  "frontend/src/components/MagneticButton.tsx": "Button component with magnetic attraction effect that tracks mouse position relative to the button and applies smooth transform animations based on cursor proximity when hovered.",
  "frontend/src/components/mobile/BiometricScanner.tsx": "Mobile biometric authentication component supporting fingerprint and face ID scanning modes with animated progress indicators, haptic feedback, and simulated scan results (80% success rate).",
  "frontend/src/components/neural/AIMirrorStatus.tsx": "Status display component showing whether the AI voice twin/neural proxy is ready or in standby mode with appropriate icons and messaging.",
  "frontend/src/components/neural/NeuralProgress.tsx": "Circular progress indicator with SVG gradient ring displaying synthesis progress percentage for neural/AI operations.",
  "frontend/src/components/neural/VocalDropZone.tsx": "Drag-and-drop file upload component for audio files (MP3, WAV, M4A) with visual feedback, file list display, and toast notifications.",
  "frontend/src/components/neural/VoiceHealthDashboard.tsx": "Dashboard displaying three voice quality metrics (Pitch Stability, Clarity Index, Tone Quality) with icons, percentages, and gradient progress bars.",
  "frontend/src/components/scheduling/SecurityAuditScheduler.tsx": "Booking interface for scheduling security audit calls with calendar date picker, time slot selection (weekdays only), and confirmation functionality.",
  "frontend/src/components/security/DarkWebMonitor.tsx": "Real-time dark web threat monitoring dashboard that generates and displays threats with filtering by type/severity, severity counts, and CSV export functionality.",
  "frontend/src/components/sentinel/EnvironmentMixer.tsx": "Audio environment mixer with volume sliders for eight ambient sound environments (office, rain, cafe, etc.) for tactical audio masking.",
  "frontend/src/components/sentinel/EnvironmentSpoofing.tsx": "React component that displays a grid of environment audio spoofing options (office, cafe, airport, etc.) with play/stop controls and visual feedback for the active environment.",
  "frontend/src/components/sentinel/HardwareMimicry.tsx": "Component that displays fake OS update screens (Windows 11 and macOS) in fullscreen mode to mimic system updates, with a close button to dismiss.",
  "frontend/src/components/sentinel/PacketJitterSimulator.tsx": "Interactive slider component to simulate network packet jitter and audio degradation, displaying quality, latency, and packet loss metrics with a keyboard shortcut (Ctrl+Shift+L) to activate lag simulation.",
  "frontend/src/components/sentinel/PanicProtocol.tsx": "Fullscreen panic mode component that displays a fake Windows 11 update screen with progress bar, dismissible via Ctrl+Shift+Q keyboard shortcut, and stores panic state in sessionStorage.",
  "frontend/src/components/settings/BandwidthOptimizer.tsx": "Settings component for adjusting streaming quality presets (low/medium/high/ultra) with live bandwidth usage meter, persisting selection to localStorage and showing estimated savings.",
  "frontend/src/components/sync/ConnectionLog.tsx": "Terminal-style scrollable log viewer that displays WebSocket connection events and simulates periodic heartbeat messages with timestamps and color-coded log types.",
  "frontend/src/components/testimonials/TestimonialCard.tsx": "Reusable card component for displaying user testimonials with avatar, name, title, 5-star rating, and quote text with hover effects.",
  "frontend/src/components/transitions/PageTransition.tsx": "Simple wrapper component that applies fade-in animation to its children for page transitions.",
  "frontend/src/components/video/VideoWelcomeWidget.tsx": "Floating video widget with play/pause controls, minimize/maximize functionality, and close button that displays an operator briefing video thumbnail in the bottom-right corner.",
  "frontend/src/components/visualizer/NetworkLatencyGlobe.tsx": "A 3D globe visualization using Three.js that displays network latency between global nodes with color-coded connections and animated rotation.",
  "frontend/src/components/visualizer/NeuralFrequencyVisualizer.tsx": "A canvas-based audio wave visualizer that renders animated sine waves representing neural frequency patterns in real-time.",
  "frontend/src/components/visualizer/WaterfallSpectrogram.tsx": "A waterfall-style spectrogram visualizer that displays frequency analysis by scrolling random frequency bars downward over time.",
  "frontend/src/contexts/GhostModeContext.tsx": "React context provider that manages ghost mode state with session storage persistence and provides toggle functionality.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated ICP actor instance, handling identity changes and query invalidation.",
  "frontend/src/hooks/useHapticFeedback.ts": "Hook providing haptic feedback functions (light, medium, heavy) using the browser's vibration API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive Internet Identity authentication hook and provider managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useKeyboardShortcut.ts": "Hook that registers keyboard shortcuts with support for modifier keys and executes callbacks when key combinations are pressed.",
  "frontend/src/hooks/useMousePosition.ts": "Hook that tracks mouse position relative to a referenced element's center point.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profiles, roles, meeting logs, panic events, audit logs, and system health metrics.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives, defines CSS custom properties for theming (light/dark modes with emerald/cyan accent colors), and includes custom animations for pulse-green and glow-emerald effects plus a ghost-mode-blur utility.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page with tabs for user management, audit logs, and system health monitoring; displays current user profile and includes components for audit log viewing and system health metrics.",
  "frontend/src/pages/AnalyticsVault.tsx": "Page displaying encrypted meeting logs in a grid layout using MeetingLogCard components; shows loading skeletons or empty state when no meetings exist.",
  "frontend/src/pages/CommandCenter.tsx": "Main dashboard page with a 12-column grid layout featuring multiple analytics components including SovereignOrb centerpiece, neural visualizers, sentiment radar, ROI ticker, biometric stress radar, speaker matrix, and system audit trail.",
  "frontend/src/pages/DeviceSync.tsx": "Device synchronization page for pairing mobile devices, displaying a QR code for remote control pairing and a connection log component.",
  "frontend/src/pages/DevMetrics.tsx": "Developer metrics page displaying system health data including cycles balance, heap/stable memory usage with charts, and critical threshold alerts; includes real-time memory history visualization using Recharts.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with fixed header, hero section featuring gradient text and CTA buttons, security architecture section with feature cards, testimonials, video widget, and footer.",
  "frontend/src/pages/LoginPage.tsx": "Login page with Internet Identity authentication, displaying a card with logo, sign-in button, and navigation to signup page.",
  "frontend/src/pages/MobileBiometric.tsx": "Mobile biometric authentication page with back navigation and BiometricScanner component.",
  "frontend/src/pages/NeuralLab.tsx": "Neural Lab page for vocal cloning and synthesis, featuring vocal sample upload, neural synthesis progress, voice health dashboard, and AI mirror status in a bento grid layout.",
  "frontend/src/pages/SentinelProtocol.tsx": "Tactical countermeasures page with emergency panic button, environment mixer, spoofing controls, packet jitter simulator, and hardware mimicry features.",
  "frontend/src/pages/Settings.tsx": "Performance settings page containing bandwidth optimizer component for system optimization.",
  "frontend/src/pages/SignupPage.tsx": "Signup page that handles Internet Identity authentication and user profile creation with username input, managing the multi-step signup flow.",
  "frontend/src/pages/Subscriptions.tsx": "Subscription pricing page displaying Basic (₹300/month) and Premium (₹500/month) tiers with feature lists and simulated subscription flow.",
  "frontend/src/pages/TacticalRemote.tsx": "Mobile tactical remote interface with large touch buttons for panic mode, lag simulation, environment spoofing, and biometric scanning with haptic feedback.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH color space, extended theme with sidebar/chart colors, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document tracking Axon's architecture (React/Node.js/Supabase/Motoko), existing features including landing page, authentication, command center dashboard, neural visualizers, sentiment tracking, and known issue with sign-in loading state."
}