{
  "backend/main.mo": "Main Motoko actor implementing meeting session management, user profiles, panic events, audit logging, session recordings, and role-based access control with authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (localStorage user registry, sign-up/sign-in validation, toggle-based auth UI) to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including authentication, dashboard layout, visualizers, hooks, and pages with localStorage-based auth and Indigo/White SaaS theme.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, including color tokens for sidebar, charts, and UI components.",
  "frontend/index.html": "HTML entry point with favicon, manifest, Inter font preload, and theme color meta tags for the AXON SOVEREIGN application.",
  "frontend/public/manifest.json": "PWA manifest for AXON Remote with standalone display mode, portrait orientation, and icon definitions for 192x192 and 512x512 sizes.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes (landing, login, signup, dashboard pages) with ProtectedRoute guards, PageTransition wrappers, and DashboardLayout.",
  "frontend/src/components/admin/AuditLogViewer.tsx": "Displays a paginated, filterable table of audit logs with CSV export functionality. Fetches audit data via useGetAuditLog hook and supports filtering by action type (LOGIN, ROLE, MEETING, PANIC, ADMIN).",
  "frontend/src/components/admin/SystemHealthMonitor.tsx": "Monitors and displays backend system health metrics including cycles balance, heap/stable memory, and query/update call counts. Shows critical alerts when thresholds are exceeded and provides manual refresh capability.",
  "frontend/src/components/analytics/BiometricStressRadar.tsx": "Renders a radar chart visualizing five biometric metrics (executive stress, vocal stability, background noise, packet health, privacy score) with simulated real-time updates every 4 seconds.",
  "frontend/src/components/analytics/EmotionTracker.tsx": "Displays a stacked area chart tracking seven emotion types (joy, surprise, fear, disgust, anger, sadness, neutral) over time with toggleable legend items and simulated data regeneration every 6 seconds.",
  "frontend/src/components/analytics/GlobalNodeMap.tsx": "Visualizes a global network map with four nodes (San Francisco, London, Tokyo, Bangalore) using SVG, showing animated pulse effects on randomly activated nodes every 3 seconds.",
  "frontend/src/components/analytics/LiveTrafficChart.tsx": "Renders a real-time area chart of network traffic data that updates every 3 seconds, maintaining a sliding window of 20 data points with random traffic values between 50-150.",
  "frontend/src/components/analytics/MeetingLogCard.tsx": "Displays a single meeting log entry as a card showing title, duration, participant count, sentiment score, cost, and optional summary with encrypted badge icon.",
  "frontend/src/components/analytics/MeetingROITicker.tsx": "Shows a live-updating meeting cost ticker that increments by ₹12.5 per second with pause/resume controls and displays the current total cost in large text.",
  "frontend/src/components/analytics/NeuralPacketStream.tsx": "Displays a real-time scrolling log of simulated security events (encryption, packet, neural, quantum) with auto-generated entries every 2-3 seconds, keeping the last 50 logs.",
  "frontend/src/components/analytics/QuantumEncryptionMonitor.tsx": "Shows quantum encryption metrics in a grid layout with four cards displaying key rotation rate, quantum resistance level, lattice crypto status, and post-quantum readiness score with circular progress indicator.",
  "frontend/src/components/analytics/RecentFilesTable.tsx": "Renders a static table of recent files with columns for name, security level, status, and owner, using colored badges to indicate security and status levels.",
  "frontend/src/components/analytics/SentimentRadar.tsx": "Displays a live area chart tracking simulated vocal stress and emotional tension metrics over time, updating every 3 seconds with a sliding 21-point window.",
  "frontend/src/components/analytics/SpeakerIdentityMatrix.tsx": "Shows a list of four speakers with their vocal frequency ranges and activity levels, displaying animated progress bars that update every 3 seconds.",
  "frontend/src/components/analytics/SystemAuditTrail.tsx": "Displays a scrolling terminal-style log of simulated system security events across six categories (encrypt, sensory, auth, network, biometric, packet), generating new entries every 2-3 seconds.",
  "frontend/src/components/analytics/ThreatDetectionMatrix.tsx": "Renders a 4x4 grid matrix showing threat counts for combinations of attack vectors and categories, with color-coded severity levels and pulse animations for active threats, updating every 5 seconds.",
  "frontend/src/components/analytics/VoicePatternTimeline.tsx": "Displays a timeline visualization of speaker voice patterns with segments showing speaker activity, volume, and duration over a 5-minute period. Includes real-time playback indicator and interactive segment selection.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Wraps children in authentication check, redirecting to login if not authenticated. Shows loading spinner during auth verification and wraps authenticated content in ErrorBoundary.",
  "frontend/src/components/auth/RoleProtectedRoute.tsx": "Enforces role-based access control by checking user role against required role (admin or user). Redirects to dashboard with toast notification if access is denied.",
  "frontend/src/components/common/ActiveStatusIndicator.tsx": "Renders a pulsing green dot with tooltip indicating active status.",
  "frontend/src/components/common/HotkeysReferenceModal.tsx": "Modal displaying categorized keyboard shortcuts with search functionality, triggered by '?' key. Shows shortcuts for security protocols, privacy features, system commands, and navigation.",
  "frontend/src/components/common/MetricCard.tsx": "Reusable card component displaying a metric with title, value, icon, and optional trend indicator. Features hover animation and clean layout.",
  "frontend/src/components/common/PrimaryCTA.tsx": "Styled primary call-to-action button with emerald gradient, shadow effects, and hover animations.",
  "frontend/src/components/dev/PerformanceOverlay.tsx": "Toggleable FPS counter overlay (Ctrl+Shift+F) that measures and displays real-time frame rate with color-coded performance indicators.",
  "frontend/src/components/effects/BorderBeam.tsx": "Animated gradient beam effect that travels along the border of its container in a diagonal pattern.",
  "frontend/src/components/effects/SovereignOrb.tsx": "3D rotating orb visualization with radial gradient, glow effects, and ripple animations on hover.",
  "frontend/src/components/errors/ErrorBoundary.tsx": "React error boundary component that catches errors and displays a styled error UI with options to retry or return home.",
  "frontend/src/components/layout/BentoCard.tsx": "Card wrapper component with glassmorphism styling and optional animated border beam effect.",
  "frontend/src/components/layout/DashboardLayout.tsx": "Main dashboard layout component with responsive sidebar navigation, user session management, and navigation items for Overview, Vault, Neural Logs, and Settings.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying AXON branding, navigation links organized by Product/Resources/Legal sections, and social media icons.",
  "frontend/src/components/MagneticButton.tsx": "Button component with magnetic attraction effect that translates based on mouse position relative to the button with configurable strength and smooth transitions.",
  "frontend/src/components/mobile/BiometricScanner.tsx": "Interactive biometric authentication component supporting fingerprint and face ID scanning modes with animated progress indicators and haptic feedback.",
  "frontend/src/components/neural/AIMirrorStatus.tsx": "Status indicator component showing whether the AI neural proxy is ready or in standby mode with appropriate icons and messages.",
  "frontend/src/components/neural/NeuralProgress.tsx": "Circular progress indicator with SVG animation displaying synthesis progress percentage for neural processing tasks.",
  "frontend/src/components/neural/VocalDropZone.tsx": "Drag-and-drop file upload component for audio files with visual feedback, file validation, and display of uploaded audio file details.",
  "frontend/src/components/neural/VoiceHealthDashboard.tsx": "Dashboard displaying voice quality metrics (pitch stability, clarity index, tone quality) with progress bars and gradient styling.",
  "frontend/src/components/scheduling/SecurityAuditScheduler.tsx": "Calendar-based scheduling component for booking security audit calls with date picker, time slot selection, and confirmation functionality.",
  "frontend/src/components/security/DarkWebMonitor.tsx": "Displays a real-time dark web threat monitoring dashboard with filtering by threat type and severity, generating simulated threats periodically and allowing CSV export of threat reports.",
  "frontend/src/components/sentinel/EnvironmentMixer.tsx": "Provides an audio environment mixer interface with volume sliders for 8 different ambient environments (office, rain, cafe, etc.) for tactical audio masking.",
  "frontend/src/components/sentinel/EnvironmentSpoofing.tsx": "Displays a grid of 16 environment presets with play/stop controls for audio spoofing, using placeholder images for different locations like office, jet, cafe, and airport.",
  "frontend/src/components/sentinel/HardwareMimicry.tsx": "Provides buttons to trigger fullscreen fake OS update screens (Windows 11 and macOS) for hardware mimicry, with a close button to dismiss.",
  "frontend/src/components/sentinel/PacketJitterSimulator.tsx": "Simulates network packet jitter with a slider control showing degradation level, quality percentage, latency, and packet loss metrics, with a Ctrl+Shift+L keyboard shortcut.",
  "frontend/src/components/sentinel/PanicProtocol.tsx": "Displays a fullscreen fake Windows update screen with progress bar as a panic protocol, dismissible via Ctrl+Shift+Q keyboard shortcut and tracked in sessionStorage.",
  "frontend/src/components/settings/BandwidthOptimizer.tsx": "Allows users to select bandwidth quality presets (low/medium/high/ultra) with live bandwidth usage meter and savings calculations, persisting selection to localStorage.",
  "frontend/src/components/sync/ConnectionLog.tsx": "Displays a scrollable terminal-style log of WebSocket connection events with timestamps, simulating periodic heartbeat and authentication messages.",
  "frontend/src/components/testimonials/TestimonialCard.tsx": "Renders a testimonial card component with avatar, name, title, 5-star rating, and quote text with hover effects.",
  "frontend/src/components/transitions/PageTransition.tsx": "Simple wrapper component that applies a fade-in animation to its children for page transitions.",
  "frontend/src/components/video/VideoWelcomeWidget.tsx": "A fixed-position video widget component with play/pause, minimize/maximize, and close controls, displaying an operator briefing thumbnail with playback simulation.",
  "frontend/src/components/visualizer/NetworkLatencyGlobe.tsx": "A 3D globe visualization using Three.js and React Three Fiber that displays global network nodes with latency-based color coding and animated connection arcs between locations.",
  "frontend/src/components/visualizer/NeuralFrequencyVisualizer.tsx": "A canvas-based audio wave visualizer that renders animated sine waves in multiple colors to simulate real-time frequency analysis.",
  "frontend/src/components/visualizer/WaterfallSpectrogram.tsx": "A canvas-based waterfall spectrogram that continuously scrolls frequency bars downward, creating a time-based visualization of audio spectrum data.",
  "frontend/src/contexts/GhostModeContext.tsx": "React context provider for managing ghost mode state, persisting the toggle state in sessionStorage across the application.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages ICP backend actor creation with authentication, handling identity changes and invalidating dependent queries when the actor updates.",
  "frontend/src/hooks/useHapticFeedback.ts": "Hook providing haptic feedback functions (light, medium, heavy) using the browser's vibration API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useKeyboardShortcut.ts": "Hook that listens for keyboard shortcut combinations and triggers a callback when all specified keys are pressed simultaneously.",
  "frontend/src/hooks/useMousePosition.ts": "Hook that tracks mouse position relative to the center of a referenced HTML element.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, meeting logs, panic events, audit logs, session recordings, and system health metrics via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (colors, radius, sidebar), utility classes for ghost mode blur, and fade-in animation keyframes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard with tabs for user management, audit logs, and system health monitoring; displays current user profile and role information.",
  "frontend/src/pages/AnalyticsVault.tsx": "Displays a grid of encrypted meeting logs fetched from the backend, showing a skeleton loader or empty state when no meetings exist.",
  "frontend/src/pages/CommandCenter.tsx": "Overview dashboard showing metric cards for encrypted data, sentinel nodes, and security health, plus live traffic chart and recent files table.",
  "frontend/src/pages/DeviceSync.tsx": "Device synchronization page showing a QR code for mobile pairing and a connection log for tactical remote control setup.",
  "frontend/src/pages/DevMetrics.tsx": "Developer performance monitoring page displaying system health metrics including cycles balance, heap/stable memory usage, and historical memory charts with critical threshold alerts.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, security architecture features, testimonials, video welcome widget, and CTAs for signing up to the sovereign neural defense platform.",
  "frontend/src/pages/LoginPage.tsx": "Login and signup page with form handling for authentication using local storage, including email/password validation, session management, and animated UI transitions between signin and signup modes.",
  "frontend/src/pages/MobileBiometric.tsx": "Mobile-optimized biometric authentication page with a back button navigation and BiometricScanner component.",
  "frontend/src/pages/NeuralLab.tsx": "Neural voice cloning lab interface with vocal sample upload, synthesis progress tracking, voice health dashboard, and AI mirror status display in a bento grid layout.",
  "frontend/src/pages/SentinelProtocol.tsx": "Tactical security controls page featuring emergency panic mode, environment spoofing, packet jitter simulation, hardware mimicry, and environment mixer components with color-coded threat levels.",
  "frontend/src/pages/Settings.tsx": "Performance settings page containing bandwidth optimization controls for system performance tuning.",
  "frontend/src/pages/SignupPage.tsx": "Internet Identity-based signup page that handles authentication flow, creates user profiles via backend actor, and navigates to dashboard upon successful account creation.",
  "frontend/src/pages/Subscriptions.tsx": "Subscription pricing page displaying Basic (₹300/month) and Premium (₹500/month) tiers with feature lists and simulated payment flow.",
  "frontend/src/pages/TacticalRemote.tsx": "Mobile tactical command interface with large touch-friendly buttons for panic mode, lag simulation, environment spoofing, and biometric scanning with haptic feedback.",
  "frontend/src/utils/localStorageAuth.ts": "Provides localStorage-based authentication utilities for user registration, login, session management, and email validation with USER/ADMIN role support.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings and hash-based routing, with sessionStorage persistence and parameter cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH color space, extended theme with sidebar/chart colors, custom animations, and typography/container plugins.",
  "project_state.json": "Project state document tracking Axon Sovereign's architecture, features, and transition from dark glassmorphism to light-mode Enterprise SaaS design with localStorage authentication and multi-page React architecture."
}