{
  "backend/main.mo": "Main Motoko actor implementing meeting session management, user profiles, panic events, audit logging, session recordings, and role-based access control with authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting three requirements for DashboardLayout sidebar visibility, CSS property verification, and responsive behavior testing.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, pages, hooks, and their key functionality for authentication, dashboard layout, visualizations, and user interactions.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, sidebar, charts, and design tokens.",
  "frontend/index.html": "HTML entry point with PWA manifest, favicon, theme color, Inter font preload, and root div for React mounting.",
  "frontend/public/manifest.json": "PWA manifest defining AXON Remote app metadata, icons, display mode (standalone), orientation (portrait), and theme colors.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for landing, login, dashboard, command center, and other pages, plus React Query, telemetry, error boundary, and session checking.",
  "frontend/src/components/admin/AuditLogViewer.tsx": "Admin component displaying paginated audit logs with filtering by action type, CSV export functionality, and success/failure status badges.",
  "frontend/src/components/admin/SystemHealthMonitor.tsx": "Displays backend system health metrics including cycles balance, heap/stable memory, and query/update call counts with color-coded alerts and refresh functionality.",
  "frontend/src/components/analytics/BiometricStressRadar.tsx": "Renders a radar chart showing five biometric stress metrics (executive stress, vocal stability, background noise, packet health, privacy score) with simulated real-time updates.",
  "frontend/src/components/analytics/EmotionTracker.tsx": "Displays a stacked area chart tracking seven emotions (joy, surprise, fear, disgust, anger, sadness, neutral) over time with toggleable legend items.",
  "frontend/src/components/analytics/GlobalNodeMap.tsx": "Visualizes a world map with four global nodes (San Francisco, London, Tokyo, Bangalore) showing animated pulse effects when nodes become active.",
  "frontend/src/components/analytics/LiveTrafficChart.tsx": "Renders a real-time area chart displaying network traffic data that updates every 3 seconds with a sliding 20-point window.",
  "frontend/src/components/analytics/MeetingLogCard.tsx": "Displays a card for a single meeting log showing title, duration, participant count, sentiment score, cost, and optional summary.",
  "frontend/src/components/analytics/MeetingROITicker.tsx": "Shows a live-updating meeting cost ticker that increments at ₹12.5/second with pause/resume functionality.",
  "frontend/src/components/analytics/NeuralPacketStream.tsx": "Displays a terminal-style scrolling log of simulated security events across four categories (ENCRYPT, PACKET, NEURAL, QUANTUM) with timestamps.",
  "frontend/src/components/analytics/QuantumEncryptionMonitor.tsx": "Displays a dashboard panel showing quantum encryption metrics including key rotation rate, quantum resistance level, lattice crypto status, and post-quantum readiness score with animated indicators and color-coded status displays.",
  "frontend/src/components/analytics/RecentFilesTable.tsx": "Renders a table of recent files with columns for name, security level, status, and owner, using color-coded badges to indicate security levels (High/Medium/Low) and file statuses (Active/Archived/Pending).",
  "frontend/src/components/analytics/SentimentRadar.tsx": "Displays a live-updating area chart tracking vocal stress and emotional tension metrics over time, with data points refreshing every 3 seconds to show sentiment analysis trends.",
  "frontend/src/components/analytics/SpeakerIdentityMatrix.tsx": "Shows a list of identified speakers with their vocal frequency ranges and activity levels, displaying each speaker with a progress bar that updates every 3 seconds to reflect changing activity percentages.",
  "frontend/src/components/analytics/SystemAuditTrail.tsx": "Implements a terminal-style scrolling log display showing real-time system events across categories like encryption, authentication, network, and biometric operations with auto-scrolling and timestamp formatting.",
  "frontend/src/components/analytics/ThreatDetectionMatrix.tsx": "Presents a grid matrix of threat detection cells showing attack vectors (Phishing, Malware, DDoS, Zero-Day) across categories (Email, Network, Application, Endpoint) with color-coded severity levels and active threat indicators that update every 5 seconds.",
  "frontend/src/components/analytics/VoicePatternTimeline.tsx": "Displays a timeline visualization of speaker voice patterns with segments showing speaker activity, volume, and duration over a 5-minute period. Includes interactive segment selection and real-time playback indicator.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Route guard component that checks Internet Identity authentication status and redirects unauthenticated users to login. Shows loading spinner during initialization.",
  "frontend/src/components/auth/RoleProtectedRoute.tsx": "Role-based route guard that verifies user permissions (admin or user) and redirects unauthorized users to dashboard with error toast. Handles loading and error states during role verification.",
  "frontend/src/components/common/ActiveStatusIndicator.tsx": "Displays an animated green pulsing dot with tooltip indicating active status.",
  "frontend/src/components/common/HotkeysReferenceModal.tsx": "Modal dialog displaying categorized keyboard shortcuts with search functionality, triggered by '?' key. Shows shortcuts for security protocols, privacy features, system commands, and navigation.",
  "frontend/src/components/common/MetricCard.tsx": "Reusable card component for displaying metrics with title, value, icon, and optional trend indicator (up/down arrow with percentage).",
  "frontend/src/components/common/PrimaryCTA.tsx": "Styled primary call-to-action button with emerald gradient, hover effects, and shadow animations.",
  "frontend/src/components/dashboard/ActivePlanCard.tsx": "Card displaying the user's current subscription plan (Sovereign Enterprise) with crown icon and plan description.",
  "frontend/src/components/dashboard/ControlPanel.tsx": "Dashboard control panel with three toggleable features (Neural Shield, Stealth Mode, AI Detection) that persist to sessionStorage and log telemetry events on toggle.",
  "frontend/src/components/dashboard/GlobalNodeMap.tsx": "Animated canvas visualization showing global node locations (NYC, London, Tokyo) with pulsing emerald dots and labels on a dark background.",
  "frontend/src/components/dashboard/Overview.tsx": "Displays a system overview dashboard card with security health KPI, network stats (active sessions, neural efficiency), and team access metrics (team members, threats), each with trend indicators.",
  "frontend/src/components/dashboard/TeamManagement.tsx": "Manages team members with a list view showing name, email, and status, allowing access revocation with toast notifications.",
  "frontend/src/components/dashboard/TeamStatusCard.tsx": "Displays a simple card showing team member names with active/idle status indicators using colored dots.",
  "frontend/src/components/dashboard/TelemetryFeed.tsx": "Shows a scrollable feed of telemetry events from TelemetryContext with timestamps and color-coded event types (success, warning, error).",
  "frontend/src/components/dev/PerformanceOverlay.tsx": "Displays a toggleable FPS counter overlay (Ctrl+Shift+F) that measures and shows frame rate with color-coded performance indicators.",
  "frontend/src/components/effects/BorderBeam.tsx": "Renders an animated gradient border beam effect that travels diagonally across a container using CSS animations.",
  "frontend/src/components/effects/SovereignOrb.tsx": "Displays a 3D rotating orb with radial gradient, glow effects, and ripple animations on hover for neural core visualization.",
  "frontend/src/components/errors/ErrorBoundary.tsx": "React error boundary component that catches errors and displays a fallback UI with error details and recovery options (try again or go home).",
  "frontend/src/components/layout/BentoCard.tsx": "Reusable card wrapper component with glassmorphism styling and optional animated border beam effect.",
  "frontend/src/components/layout/DashboardLayout.tsx": "Main dashboard layout with sidebar navigation, user profile display, navigation items (command center, security, team, pricing, settings), and logout functionality with Internet Identity integration.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with AXON branding, navigation links organized into Product/Resources/Legal sections, and social media icons. Includes copyright notice and company tagline.",
  "frontend/src/components/MagneticButton.tsx": "Button component with magnetic attraction effect that translates based on mouse position when hovered using custom useMousePosition hook.",
  "frontend/src/components/mobile/BiometricScanner.tsx": "Mobile biometric authentication component supporting fingerprint and face ID scanning modes with animated progress indicators, haptic feedback, and simulated success/error states.",
  "frontend/src/components/neural/AIMirrorStatus.tsx": "Status display component showing whether the AI voice twin (Neural Proxy) is ready or in standby mode with appropriate icons and messaging.",
  "frontend/src/components/neural/NeuralProgress.tsx": "Circular progress indicator with SVG-based animated ring showing synthesis progress percentage with gradient styling.",
  "frontend/src/components/neural/VocalDropZone.tsx": "Drag-and-drop file upload component for audio files with visual feedback, file validation, and display of uploaded audio file details.",
  "frontend/src/components/neural/VoiceHealthDashboard.tsx": "Dashboard displaying voice quality metrics (Pitch Stability, Clarity Index, Tone Quality) with progress bars and icons in a grid layout.",
  "frontend/src/components/scheduling/SecurityAuditScheduler.tsx": "Calendar-based booking interface for scheduling security audit calls with date picker, time slot selection, and confirmation functionality.",
  "frontend/src/components/security/DarkWebMonitor.tsx": "Real-time dark web threat monitoring dashboard with auto-generated threats, filtering by type/severity, severity statistics, and CSV export functionality.",
  "frontend/src/components/sentinel/EnvironmentMixer.tsx": "Audio environment mixer with volume sliders for eight different ambient sound environments (office, rain, cafe, etc.) for tactical audio masking.",
  "frontend/src/components/sentinel/EnvironmentSpoofing.tsx": "Displays a grid of environment audio spoofing options (office, cafe, airport, etc.) with thumbnail images and play/stop controls to simulate different background audio environments.",
  "frontend/src/components/sentinel/HardwareMimicry.tsx": "Provides buttons to trigger fake OS update screens (Windows 11, macOS) in fullscreen overlay mode with a close button.",
  "frontend/src/components/sentinel/PacketJitterSimulator.tsx": "Slider-based UI to simulate network packet jitter and audio degradation, displaying quality, latency, and packet loss metrics with a keyboard shortcut (Ctrl+Shift+L) to activate lag simulation.",
  "frontend/src/components/sentinel/PanicProtocol.tsx": "Full-screen fake Windows update overlay with progress bar that can be dismissed via Ctrl+Shift+Q keyboard shortcut; stores panic state in sessionStorage.",
  "frontend/src/components/settings/BandwidthOptimizer.tsx": "Bandwidth quality selector with four presets (low, medium, high, ultra) showing live usage meter, estimated bandwidth, and savings percentage; persists selection to localStorage.",
  "frontend/src/components/sync/ConnectionLog.tsx": "Scrollable terminal-style log display showing WebSocket connection events with timestamps, simulating periodic heartbeat and authentication messages.",
  "frontend/src/components/testimonials/TestimonialCard.tsx": "Reusable card component displaying user testimonials with avatar, name, title, 5-star rating, and quote text.",
  "frontend/src/components/transitions/NeuralScanTransition.tsx": "Full-screen loading transition with AXON logo, progress bar, and animated scan line effect that completes at 100% and calls onComplete callback.",
  "frontend/src/components/transitions/PageTransition.tsx": "Simple wrapper component that applies a fade-in animation to its children for page transitions.",
  "frontend/src/components/video/VideoWelcomeWidget.tsx": "Floating video widget in bottom-right corner with play/pause controls, minimize/maximize functionality, and close button; displays operator briefing thumbnail with simulated playback progress.",
  "frontend/src/components/visualizer/NetworkLatencyGlobe.tsx": "A 3D globe visualization using Three.js that displays network latency between global nodes with color-coded connections and animated rotation.",
  "frontend/src/components/visualizer/NeuralFrequencyVisualizer.tsx": "A canvas-based audio wave visualizer that renders animated sinusoidal waveforms in real-time with multiple overlapping frequency patterns.",
  "frontend/src/components/visualizer/WaterfallSpectrogram.tsx": "A waterfall-style spectrogram visualizer that displays frequency analysis as scrolling vertical bars with intensity-based coloring.",
  "frontend/src/contexts/GhostModeContext.tsx": "React context provider for managing ghost mode state with sessionStorage persistence and toggle functionality.",
  "frontend/src/contexts/TelemetryContext.tsx": "React context provider for logging and managing telemetry events with type classification and a 50-event history limit.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages ICP actor creation with Internet Identity authentication, handles actor lifecycle, and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useHapticFeedback.ts": "Custom hook providing haptic feedback utilities with light, medium, and heavy vibration patterns using the Navigator Vibration API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider for Internet Identity authentication, managing login state, identity persistence, and delegation validation with AuthClient.",
  "frontend/src/hooks/useKeyboardShortcut.ts": "Custom hook that registers keyboard shortcut listeners with support for modifier keys and prevents default behavior when shortcuts are triggered.",
  "frontend/src/hooks/useMousePosition.ts": "Custom hook that tracks mouse position relative to a referenced element's center point.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for managing user profiles, roles, meeting logs, panic events, and audit logs with ICP actor integration.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for a dark theme with emerald accents, plus utility classes for blur effects and fade-in animations.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard with tabs for user management, audit logs, and system health monitoring; displays current user profile and includes a note that full user listing requires backend implementation.",
  "frontend/src/pages/AnalyticsVault.tsx": "Displays a grid of encrypted meeting logs fetched from backend; shows loading skeletons or empty state when no meetings exist.",
  "frontend/src/pages/CommandCenter.tsx": "Main dashboard page with a responsive grid layout containing Overview, ControlPanel, TelemetryFeed, GlobalNodeMap, and TeamManagement components.",
  "frontend/src/pages/DeviceSync.tsx": "Device pairing page that displays a QR code for mobile synchronization and a connection log for tracking paired devices.",
  "frontend/src/pages/DevMetrics.tsx": "Developer metrics dashboard showing system health including cycles balance, heap/stable memory usage with line charts, and critical threshold alerts.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, security features showcase, testimonials, and CTAs directing users to login for a sovereign trial.",
  "frontend/src/pages/LoginPage.tsx": "Authentication page that handles Internet Identity login flow with session management and redirects to command center on success.",
  "frontend/src/pages/MobileBiometric.tsx": "Mobile-specific page for biometric authentication with back navigation to the remote control interface.",
  "frontend/src/pages/NeuralLab.tsx": "Neural Lab page with vocal sample upload, voice synthesis controls, progress tracking, voice health dashboard, and AI mirror status display using a bento grid layout.",
  "frontend/src/pages/SentinelProtocol.tsx": "Sentinel Protocol page featuring emergency panic mode, environment mixer, spoofing controls, packet jitter simulator, and hardware mimicry with tactical HUD background.",
  "frontend/src/pages/Settings.tsx": "Settings page containing bandwidth optimizer component for performance tuning.",
  "frontend/src/pages/SignupPage.tsx": "Empty signup page file with no content.",
  "frontend/src/pages/Subscriptions.tsx": "Subscriptions page displaying Basic (₹299/month) and Premium (₹499/month) pricing tiers with feature lists and simulated subscription flow.",
  "frontend/src/pages/TacticalRemote.tsx": "Mobile tactical remote interface with large touch buttons for panic mode, lag simulation, environment spoofing, and biometric scanning with haptic feedback.",
  "frontend/src/utils/localStorageAuth.ts": "Empty authentication utility file with no content.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting, persisting, and clearing parameters from both regular query strings and hash-based routing with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom OKLCH color system, sidebar theming, emerald accent colors, custom animations, and typography/container query plugins.",
  "project_state.json": "Project state tracking sidebar visibility issue in DashboardLayout with Deep Onyx background and Emerald accents, marked as fix request."
}