{
  "backend/main.mo": "Main Motoko actor implementing meeting session management, user profiles, panic events, audit logging, session recordings, and role-based access control with authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (dashboard layout, control panel, telemetry feed, team status, etc.) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, pages, hooks, and utilities with their key functionality and recent changes.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for background, foreground, borders, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the React app with favicon, manifest, Inter font preload, and AXON SOVEREIGN branding.",
  "frontend/public/manifest.json": "PWA manifest defining AXON Remote as a standalone portrait mobile app with black theme and icon assets.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (landing, login, signup, dashboard pages), React Query, TelemetryProvider, and error boundary.",
  "frontend/src/components/admin/AuditLogViewer.tsx": "Displays a paginated, filterable table of audit logs with CSV export functionality, showing timestamps, actions, users, and success status for security-sensitive operations.",
  "frontend/src/components/admin/SystemHealthMonitor.tsx": "Monitors and displays backend system health metrics including cycles balance, heap/stable memory usage, and query/update call counts with visual indicators and critical threshold alerts.",
  "frontend/src/components/analytics/BiometricStressRadar.tsx": "Renders a radar chart visualizing five biometric metrics (executive stress, vocal stability, background noise, packet health, privacy score) with simulated real-time updates.",
  "frontend/src/components/analytics/EmotionTracker.tsx": "Displays a stacked area chart tracking seven emotion types (joy, surprise, fear, disgust, anger, sadness, neutral) over time with toggleable emotion visibility.",
  "frontend/src/components/analytics/GlobalNodeMap.tsx": "Visualizes a global network map with animated node activity indicators for distributed nodes in San Francisco, London, Tokyo, and Bangalore.",
  "frontend/src/components/analytics/LiveTrafficChart.tsx": "Shows a real-time area chart of network traffic data that updates every 3 seconds with a sliding 20-point window.",
  "frontend/src/components/analytics/MeetingLogCard.tsx": "Displays a card with meeting details including title, duration, participant count, sentiment score, cost, and optional summary.",
  "frontend/src/components/analytics/MeetingROITicker.tsx": "Shows a live-updating cost ticker for meetings that increments at ₹12.5 per second with pause/resume functionality.",
  "frontend/src/components/analytics/NeuralPacketStream.tsx": "Displays a real-time scrolling log of simulated security events (encryption, packet, neural, quantum) with auto-generated entries every 2-3 seconds, keeping the last 50 logs.",
  "frontend/src/components/analytics/QuantumEncryptionMonitor.tsx": "Shows quantum encryption metrics including key rotation rate, quantum resistance level, lattice crypto status, and post-quantum readiness score with a circular progress indicator, updating every 8 seconds.",
  "frontend/src/components/analytics/RecentFilesTable.tsx": "Renders a static table of recent files with columns for name, security level, status, and owner, using color-coded badges for security levels and statuses.",
  "frontend/src/components/analytics/SentimentRadar.tsx": "Displays a live area chart tracking simulated vocal stress and emotional tension metrics over time, updating every 3 seconds with a rolling 21-point window.",
  "frontend/src/components/analytics/SpeakerIdentityMatrix.tsx": "Shows a list of speakers with their vocal frequency ranges and activity levels, represented by animated progress bars that update every 3 seconds.",
  "frontend/src/components/analytics/SystemAuditTrail.tsx": "Displays a scrolling terminal-style log of simulated system security events across categories like encryption, authentication, and network, generating new entries every 2-3 seconds.",
  "frontend/src/components/analytics/ThreatDetectionMatrix.tsx": "Presents a 4x4 grid of threat detection cells showing attack vectors (phishing, malware, DDoS, zero-day) across categories (email, network, application, endpoint) with color-coded severity levels, updating every 5 seconds.",
  "frontend/src/components/analytics/VoicePatternTimeline.tsx": "Displays a timeline visualization of speaker voice patterns with segments showing speaker activity, volume, and duration over a 5-minute period. Includes interactive segment selection and real-time playback indicator.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Wraps child components with authentication checking, redirecting to login if not authenticated. Shows a loading spinner during authentication verification.",
  "frontend/src/components/auth/RoleProtectedRoute.tsx": "Protects routes based on user role (admin or user), fetching role from API and redirecting to dashboard with error toast if insufficient permissions. Displays loading state during role verification.",
  "frontend/src/components/common/ActiveStatusIndicator.tsx": "Renders a pulsing green dot with tooltip indicating active status.",
  "frontend/src/components/common/HotkeysReferenceModal.tsx": "Modal displaying categorized keyboard shortcuts with search functionality, triggered by '?' key. Shows shortcuts for security protocols, privacy features, system commands, and navigation.",
  "frontend/src/components/common/MetricCard.tsx": "Reusable card component displaying a metric with title, value, icon, and optional trend indicator. Features hover animation.",
  "frontend/src/components/common/PrimaryCTA.tsx": "Styled primary call-to-action button with emerald gradient, shadow effects, and hover animations.",
  "frontend/src/components/dashboard/ActivePlanCard.tsx": "Card displaying the current subscription plan (Sovereign Enterprise) with a logout button that clears session and redirects to login.",
  "frontend/src/components/dashboard/ControlPanel.tsx": "Dashboard card with toggle switches for Neural Shield and Stealth Mode features, persisting state to sessionStorage and logging events via telemetry context.",
  "frontend/src/components/dashboard/TeamStatusCard.tsx": "Displays a list of team members with their current status (active/idle) indicated by colored dots.",
  "frontend/src/components/dashboard/TelemetryFeed.tsx": "Scrollable feed displaying timestamped telemetry events from the telemetry context, color-coded by event type (success, warning, error).",
  "frontend/src/components/dev/PerformanceOverlay.tsx": "Developer overlay showing real-time FPS counter, toggled with Ctrl+Shift+F keyboard shortcut. Color-codes FPS display based on performance thresholds.",
  "frontend/src/components/effects/BorderBeam.tsx": "Animated border effect component that creates a moving gradient beam along the edges of a container using CSS keyframe animations.",
  "frontend/src/components/effects/SovereignOrb.tsx": "Interactive 3D orb visualization with hover effects, ripple animations, and continuous rotation, styled with radial gradients and glowing shadows.",
  "frontend/src/components/errors/ErrorBoundary.tsx": "React error boundary class component that catches rendering errors and displays a styled error card with retry and home navigation options.",
  "frontend/src/components/layout/BentoCard.tsx": "Reusable card wrapper component with glassmorphism styling and optional animated border beam effect.",
  "frontend/src/components/layout/DashboardLayout.tsx": "Main dashboard layout with responsive sidebar navigation, user session management, logout functionality, and mobile sheet menu.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with brand information, navigation links organized in columns (Product, Resources, Legal), and social media icons.",
  "frontend/src/components/MagneticButton.tsx": "Button component with magnetic attraction effect that translates based on mouse position within the element using custom useMousePosition hook.",
  "frontend/src/components/mobile/BiometricScanner.tsx": "Biometric authentication UI with fingerprint and face ID modes, animated scanning progress, haptic feedback, and success/error states.",
  "frontend/src/components/neural/AIMirrorStatus.tsx": "Status indicator component showing whether the AI neural proxy is ready or in standby mode with appropriate icons and messages.",
  "frontend/src/components/neural/NeuralProgress.tsx": "Circular progress indicator using SVG with gradient stroke to display neural synthesis progress percentage.",
  "frontend/src/components/neural/VocalDropZone.tsx": "Drag-and-drop file upload zone for audio files with visual feedback, file validation, and uploaded file list display.",
  "frontend/src/components/neural/VoiceHealthDashboard.tsx": "Dashboard displaying voice quality metrics (pitch stability, clarity, tone) with progress bars and gradient-styled cards.",
  "frontend/src/components/scheduling/SecurityAuditScheduler.tsx": "A React component that provides a calendar-based scheduler for booking security audit calls, allowing users to select dates (excluding weekends) and time slots, then confirm bookings with toast notifications.",
  "frontend/src/components/security/DarkWebMonitor.tsx": "A dark web monitoring dashboard that generates and displays simulated threats (credential leaks, data breaches, brand mentions) with severity levels, filtering capabilities, and CSV export functionality.",
  "frontend/src/components/sentinel/EnvironmentMixer.tsx": "An audio environment mixer component with volume sliders for eight different ambient soundscapes (office, rain, cafe, airport, forest, ocean, city, datacenter) for tactical audio masking.",
  "frontend/src/components/sentinel/EnvironmentSpoofing.tsx": "A component that displays a grid of 16 environment options (office, jet, cafe, etc.) with play/stop controls to activate audio spoofing for different background environments.",
  "frontend/src/components/sentinel/HardwareMimicry.tsx": "A component that displays fake OS update screens (Windows 11 or macOS) in fullscreen mode to mimic system updates, with a close button to dismiss.",
  "frontend/src/components/sentinel/PacketJitterSimulator.tsx": "A network simulation tool with a slider to control packet jitter/audio degradation levels, displaying quality, latency, and packet loss metrics, with a Ctrl+Shift+L keyboard shortcut.",
  "frontend/src/components/sentinel/PanicProtocol.tsx": "A fullscreen panic mode component that displays a fake Windows 11 update screen with progress bar, dismissible via Ctrl+Shift+Q keyboard shortcut, and stores state in sessionStorage.",
  "frontend/src/components/settings/BandwidthOptimizer.tsx": "A bandwidth optimization settings component with four quality presets (low to ultra), live bandwidth usage meter, and localStorage persistence for quality preferences.",
  "frontend/src/components/sync/ConnectionLog.tsx": "Displays a scrollable terminal-style log of WebSocket connection events with timestamps, simulating periodic heartbeat and sync messages.",
  "frontend/src/components/testimonials/TestimonialCard.tsx": "Renders a testimonial card with avatar, name, title, 5-star rating, and quote text with hover effects.",
  "frontend/src/components/transitions/NeuralScanTransition.tsx": "Full-screen transition component showing AXON logo with animated progress bar and scan line effect, calls onComplete when finished.",
  "frontend/src/components/transitions/PageTransition.tsx": "Simple wrapper component that applies a fade-in animation to its children.",
  "frontend/src/components/video/VideoWelcomeWidget.tsx": "Fixed-position video widget with play/pause controls, minimize/maximize, and close functionality, displaying an operator briefing thumbnail.",
  "frontend/src/components/visualizer/NetworkLatencyGlobe.tsx": "3D globe visualization using Three.js showing global network nodes with color-coded latency indicators and animated connection arcs.",
  "frontend/src/components/visualizer/NeuralFrequencyVisualizer.tsx": "Canvas-based audio wave visualizer rendering animated sine waves in blue and purple with real-time frequency analysis display.",
  "frontend/src/components/visualizer/WaterfallSpectrogram.tsx": "Canvas-based waterfall spectrogram that scrolls frequency bars downward, creating a real-time frequency analysis visualization.",
  "frontend/src/contexts/GhostModeContext.tsx": "React context providing ghost mode toggle state persisted in sessionStorage across the application.",
  "frontend/src/contexts/TelemetryContext.tsx": "React context for logging and managing telemetry events with timestamps, types, and a 50-event history limit.",
  "frontend/src/hooks/useActor.ts": "Custom hook managing backend actor creation with Internet Identity authentication, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useHapticFeedback.ts": "Custom hook providing haptic feedback utilities with light, medium, and heavy vibration patterns using the Vibration API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useKeyboardShortcut.ts": "Custom React hook that listens for keyboard shortcuts by tracking pressed keys and triggering a callback when all specified keys (including modifiers) are pressed simultaneously.",
  "frontend/src/hooks/useMousePosition.ts": "Custom React hook that tracks mouse position relative to the center of a referenced HTML element, returning normalized x and y coordinates.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend canister operations including user profiles, roles, meeting logs, panic events, audit logs, session recordings, and system health metrics.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for a dark theme using Deep Onyx backgrounds and Emerald accents, plus utility classes for ghost mode blur and animations.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard with tabs for user management, audit logs, and system health monitoring, displaying current user profile and role information.",
  "frontend/src/pages/AnalyticsVault.tsx": "Displays a grid of encrypted meeting logs fetched from the backend, showing loading skeletons or an empty state when no meetings exist.",
  "frontend/src/pages/CommandCenter.tsx": "Main dashboard page showing system metrics (encrypted data, sentinel nodes, security health), control panel, active plan, team status, and telemetry feed in a responsive grid layout.",
  "frontend/src/pages/DeviceSync.tsx": "Provides device pairing interface with QR code display for mobile synchronization and a connection log component for monitoring paired devices.",
  "frontend/src/pages/DevMetrics.tsx": "Displays system health metrics including cycles balance, heap/stable memory usage, and real-time memory charts with critical threshold alerts and color-coded status indicators.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, security architecture features, testimonials, and CTAs directing users to login for a sovereign trial.",
  "frontend/src/pages/LoginPage.tsx": "Authentication page with email/password form that validates credentials via local storage and shows a neural scan transition animation on first login.",
  "frontend/src/pages/MobileBiometric.tsx": "Mobile-optimized biometric authentication page with a back button and BiometricScanner component for fingerprint/face verification.",
  "frontend/src/pages/NeuralLab.tsx": "Voice cloning interface with vocal sample upload, neural synthesis progress tracking, voice health dashboard, and AI mirror status display.",
  "frontend/src/pages/SentinelProtocol.tsx": "Tactical security controls page featuring emergency panic mode activation, environment spoofing, packet jitter simulation, hardware mimicry, and environment mixing tools.",
  "frontend/src/pages/Settings.tsx": "Performance settings page containing bandwidth optimization controls for system tuning.",
  "frontend/src/pages/SignupPage.tsx": "Signup page component that handles user registration via Internet Identity authentication and creates a user profile with a username. Uses React hooks for authentication flow, actor initialization, and profile mutation with loading states and toast notifications.",
  "frontend/src/pages/Subscriptions.tsx": "Subscription pricing page displaying Basic (₹300/month) and Premium (₹500/month) tiers with feature lists and simulated subscription flow. Uses BentoCard layout components and toast notifications for user feedback.",
  "frontend/src/pages/TacticalRemote.tsx": "Mobile tactical remote control interface with large touch-friendly buttons for panic mode, lag simulation, environment spoofing, and biometric scanning. Includes haptic feedback and navigation to biometric scan page.",
  "frontend/src/utils/localStorageAuth.ts": "LocalStorage-based authentication utility providing user registration, login, session management, and email validation functions. Stores user data and session information in browser localStorage with role-based access (USER/ADMIN).",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities that work with both standard query strings and hash-based routing. Provides functions to extract, persist, and clear URL parameters using sessionStorage for cross-navigation state management.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with sidebar/chart colors, custom animations, and typography/container-queries plugins. Defines design tokens for the application's visual system.",
  "project_state.json": "Project state tracking file documenting a dashboard application with Deep Onyx/Emerald color scheme, localStorage authentication, bento-style layout, and 11 implemented features including control panel, telemetry feed, and team status. Contains architectural notes, feature tracking with requirement IDs, and version history."
}