{
  "backend/main.mo": "Motoko actor implementing meeting session management with user signup, meeting start/end tracking, sentiment scoring, cost calculation, and query functions for retrieving meeting data stored in Maps.",
  "feature_evidence.json": "Feature evidence report documenting four features related to fixing React hydration errors after signup, ensuring proper authentication flow, verifying ProtectedRoute state handling, and adding error boundaries.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, hooks, pages, and utilities with descriptions of their functionality and recent fixes.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for UI components, charts, sidebar, and design tokens using oklch color space.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tags, PWA manifest link, and script tag loading the main TypeScript module.",
  "frontend/public/manifest.json": "PWA manifest defining Aegis Sovereign Remote as a standalone mobile app with portrait orientation, black theme, and 512x512 icon configuration.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (landing, auth, dashboard pages), theme provider, global panic protocol keyboard shortcut (Ctrl+Shift+P), and top-level ErrorBoundary wrapper.",
  "frontend/src/components/analytics/MeetingLogCard.tsx": "Card component displaying meeting session details including duration, participant count, sentiment score, and cost with encrypted lock icon and hover effects.",
  "frontend/src/components/analytics/MeetingROITicker.tsx": "Live counter component incrementing meeting cost at ₹12.5 per second with pause/resume control and trending indicator display.",
  "frontend/src/components/analytics/SentimentRadar.tsx": "Displays a live-updating area chart tracking vocal stress and emotional tension metrics over time with mock data generated every 3 seconds.",
  "frontend/src/components/analytics/SpeakerIdentityMatrix.tsx": "Shows a scrollable list of speakers with their vocal frequency analysis and activity percentages, updating every 5 seconds with randomized data.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Authentication wrapper component that redirects unauthenticated users to login and shows loading states during authentication checks.",
  "frontend/src/components/effects/BorderBeam.tsx": "Animated border effect component that creates a moving gradient beam along the edges of its container using CSS animations.",
  "frontend/src/components/errors/ErrorBoundary.tsx": "React error boundary class component that catches rendering errors and displays a fallback UI with error details and recovery options.",
  "frontend/src/components/layout/BentoCard.tsx": "Reusable card wrapper component with glassmorphism styling and optional animated border beam effect.",
  "frontend/src/components/layout/DashboardLayout.tsx": "Main dashboard layout with responsive sidebar navigation, user profile display, keyboard shortcuts (Cmd/Ctrl+K for sentinel mode), and logout functionality.",
  "frontend/src/components/MagneticButton.tsx": "Button component with magnetic attraction effect that translates based on mouse position relative to the button with configurable strength and smooth transitions.",
  "frontend/src/components/neural/AIMirrorStatus.tsx": "Status indicator component showing whether the AI voice proxy is ready or in standby mode with appropriate icons and messaging.",
  "frontend/src/components/neural/NeuralProgress.tsx": "Circular progress indicator using SVG to display synthesis progress percentage with gradient stroke animation.",
  "frontend/src/components/neural/VocalDropZone.tsx": "Drag-and-drop file upload zone for audio files that validates file types and displays uploaded file information.",
  "frontend/src/components/neural/VoiceHealthDashboard.tsx": "Dashboard displaying three voice quality metrics (pitch stability, clarity index, tone quality) with progress bars and icons.",
  "frontend/src/components/sentinel/EnvironmentSpoofing.tsx": "React component that displays a grid of 16 environment audio spoofing options (office, cafe, airport, etc.) with play/stop toggle buttons and preview images.",
  "frontend/src/components/sentinel/HardwareMimicry.tsx": "React component that displays fake OS update screens (Windows 11 and macOS) in fullscreen overlay mode when activated.",
  "frontend/src/components/sentinel/PacketJitterSimulator.tsx": "React component with a slider to simulate network packet jitter/lag, displaying quality, latency, and packet loss metrics with Ctrl+Shift+L hotkey support.",
  "frontend/src/components/sentinel/PanicProtocol.tsx": "React component that displays a fullscreen fake system update screen with glitch animation and progress bar, closable via button.",
  "frontend/src/components/sync/ConnectionLog.tsx": "React component that displays a scrollable terminal-style log of WebSocket connection events with timestamps and color-coded message types.",
  "frontend/src/components/transitions/PageTransition.tsx": "Simple wrapper component that applies a fade-in animation to its children for page transitions.",
  "frontend/src/components/visualizer/NeuralFrequencyVisualizer.tsx": "React component that renders an animated canvas visualization of audio frequency waves using sine/cosine functions with two overlapping waveforms.",
  "frontend/src/hooks/useActor.ts": "React hook that manages Internet Computer actor creation with authentication, using React Query to cache and invalidate dependent queries when identity changes.",
  "frontend/src/hooks/useHapticFeedback.ts": "React hook that provides haptic feedback functions (light, medium, heavy) using the browser's vibration API.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication on Internet Computer, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useKeyboardShortcut.ts": "React hook that listens for keyboard shortcut combinations (including modifier keys) and triggers a callback when all keys are pressed.",
  "frontend/src/hooks/useMousePosition.ts": "React hook that tracks mouse position relative to the center of a referenced HTML element.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user sign-up, meeting CRUD operations (start, end, get, getAll), and updating meeting sentiment/cost with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (colors, borders, charts, sidebar) in both light and dark modes, plus base styles for body and borders.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/AnalyticsVault.tsx": "Displays a grid of meeting log cards fetched from the backend, showing loading skeletons or an empty state with a lock icon when no meetings exist.",
  "frontend/src/pages/CommandCenter.tsx": "Dashboard page with a bento grid layout displaying real-time meeting intelligence components: neural visualizer, sentiment radar, ROI ticker, and speaker identity matrix.",
  "frontend/src/pages/DeviceSync.tsx": "Device pairing page that displays a QR code frame for mobile synchronization and a connection log in a two-column bento grid layout.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, security architecture cards (quantum encryption, SOC2 compliance, biometric integrity), header navigation, and CTA buttons for signup/login.",
  "frontend/src/pages/LoginPage.tsx": "Login page with Internet Identity authentication button that redirects to dashboard on success and shows loading state during authentication.",
  "frontend/src/pages/NeuralLab.tsx": "Voice cloning interface with vocal sample upload, neural synthesis progress tracking, voice health dashboard, and AI mirror status in a bento grid layout with background image.",
  "frontend/src/pages/SentinelProtocol.tsx": "Security/privacy controls page featuring emergency panic button, environment spoofing, packet jitter simulator, and hardware mimicry components with tactical HUD background.",
  "frontend/src/pages/SignupPage.tsx": "React signup page component that collects username, initiates Internet Identity authentication, and creates user account via useSignUp mutation before navigating to dashboard.",
  "frontend/src/pages/TacticalRemote.tsx": "Mobile tactical remote interface with three large buttons (Panic Mode, Lag Simulation, Environment Spoof) that trigger haptic feedback and toast notifications.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme for sidebar/chart colors, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking Aegis Sovereign's architecture (React/Node/Supabase), existing features (landing page, auth, dashboard, neural visualizer, sentiment tracking), known React error #185 issue, and design specifications (glassmorphism, 60fps canvas, PWA)."
}