{
  "backend/main.mo": "Main Motoko actor implementing meeting intelligence backend with role-based access control, user profiles, meeting logs, panic events, audit logging, session recordings, and system health metrics with authorization checks on all operations.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: null-check guard for store initialization, homepage-view as default entry point, localStorage persistence repair, dashboard authentication guard, and spectral analysis component re-injection.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, pages, hooks, and utilities with focus on authentication flow, dashboard layout, visualizations, and tier-based feature gating.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, borders, charts, and sidebar components using oklch color space.",
  "frontend/index.html": "HTML entry point with PWA manifest, theme color, favicon, Inter font preload, and root div for React mounting.",
  "frontend/public/manifest.json": "PWA manifest defining AXON Remote as a standalone portrait-mode mobile app with black theme and 192x192/512x512 icon assets.",
  "frontend/src/App.tsx": "Root application component managing three views (homepage, login, dashboard) with forced homepage-view as default entry point, storage initialization on mount, session validation, and proper cleanup on logout.",
  "frontend/src/components/admin/AuditLogViewer.tsx": "Displays a filterable, paginated table of audit logs with action filtering, CSV export functionality, and shows timestamp, action, user, status, and details for each log entry.",
  "frontend/src/components/admin/SystemHealthMonitor.tsx": "Monitors and displays backend system health metrics including cycles balance, heap memory, stable memory, and query/update call counts with visual progress bars and critical threshold alerts.",
  "frontend/src/components/analytics/BiometricStressRadar.tsx": "Renders a radar chart displaying five biometric metrics (executive stress, vocal stability, background noise, packet health, privacy score) with simulated real-time updates every 4 seconds.",
  "frontend/src/components/analytics/EmotionTracker.tsx": "Displays a stacked area chart tracking seven emotion types (joy, surprise, fear, disgust, anger, sadness, neutral) over time with toggleable emotion visibility and auto-refreshing data.",
  "frontend/src/components/analytics/GlobalNodeMap.tsx": "Visualizes a global network map with four geographic nodes (San Francisco, London, Tokyo, Bangalore) showing animated pulse effects when nodes become active.",
  "frontend/src/components/analytics/LiveTrafficChart.tsx": "Renders a real-time area chart showing network traffic data that updates every 3 seconds with a sliding 20-point window.",
  "frontend/src/components/analytics/MeetingLogCard.tsx": "Displays a card component for a single meeting log showing title, duration, participant count, sentiment score, cost, and optional summary.",
  "frontend/src/components/analytics/MeetingROITicker.tsx": "Shows a live-updating meeting cost ticker that increments by ₹12.5 per second with pause/resume functionality.",
  "frontend/src/components/analytics/NeuralPacketStream.tsx": "Displays a real-time scrolling log of simulated security events (encryption, packet, neural, quantum) with auto-generated entries every 2-3 seconds, maintaining the last 50 logs.",
  "frontend/src/components/analytics/QuantumEncryptionMonitor.tsx": "Shows quantum encryption metrics in a 2x2 grid including key rotation rate, quantum resistance level, lattice crypto status, and a circular post-quantum readiness gauge that updates every 8 seconds.",
  "frontend/src/components/analytics/RecentFilesTable.tsx": "Renders a static table of recent files with columns for name, security level, status, and owner, using color-coded badges for security levels and statuses.",
  "frontend/src/components/analytics/SentimentRadar.tsx": "Displays a live area chart tracking vocal stress and emotional tension metrics over time, updating every 3 seconds with new data points while maintaining a 21-point rolling window.",
  "frontend/src/components/analytics/SpeakerIdentityMatrix.tsx": "Shows a list of speaker profiles with vocal frequency ranges and activity percentages, featuring animated progress bars that update every 3 seconds.",
  "frontend/src/components/analytics/SystemAuditTrail.tsx": "Displays a terminal-style scrolling log of system security events across six categories (encrypt, sensory, auth, network, biometric, packet), generating new entries every 2-3 seconds.",
  "frontend/src/components/analytics/ThreatDetectionMatrix.tsx": "Presents a 4x4 grid of threat detection cells showing attack vectors vs categories with color-coded severity levels, threat counts, and active status indicators that refresh every 5 seconds.",
  "frontend/src/components/analytics/VoicePatternTimeline.tsx": "Displays a timeline visualization of speaker voice patterns with segments showing speaker activity, volume, and duration across a 5-minute period. Includes interactive segment selection and real-time playback indicator.",
  "frontend/src/components/auth/AuthPanel.tsx": "Reusable authentication panel wrapper component with tactical glass styling, scanlines overlay, AXON logo, and shake animation support for error states.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Route guard component that checks for active session using local storage and redirects to login if unauthorized, showing a loading spinner during verification.",
  "frontend/src/components/auth/RegisterView.tsx": "Registration form view with fields for full name, email, password, and password confirmation, including password visibility toggles and form validation.",
  "frontend/src/components/auth/RoleProtectedRoute.tsx": "Role-based route guard that verifies user permissions (admin or user) via API query and redirects to command center if access is denied, with loading state handling.",
  "frontend/src/components/auth/SignInView.tsx": "Sign-in form view with email/username and password fields, remember me checkbox, password visibility toggle, and social login buttons for Google and Facebook.",
  "frontend/src/components/auth/ThreeBackground.tsx": "Animated 3D background using Three.js with floating geometric shapes (cubes, spheres, toruses) that rotate and float over a radial gradient backdrop.",
  "frontend/src/components/common/ActiveStatusIndicator.tsx": "Small status indicator component displaying a pulsing green dot with tooltip showing 'Status: Active'.",
  "frontend/src/components/common/FeatureLockedOverlay.tsx": "Full-screen overlay modal that displays when a feature is locked, prompting users to upgrade to Shield tier subscription with pricing and upgrade button.",
  "frontend/src/components/common/HotkeysReferenceModal.tsx": "Modal dialog displaying searchable keyboard shortcuts organized by category (Security, Privacy, System, Navigation) with accordion UI and escape/question-mark hotkey triggers.",
  "frontend/src/components/common/MetricCard.tsx": "Reusable card component displaying a metric with title, value, icon, and optional trend indicator (up/down arrow with color coding).",
  "frontend/src/components/common/PrimaryCTA.tsx": "Styled primary call-to-action button with emerald gradient, hover effects, and scale animation.",
  "frontend/src/components/common/SentinelPanicButton.tsx": "Fixed floating panic button that triggers emergency protocol via mutation, shows confirmation dialog, and navigates to sentinel dashboard on activation.",
  "frontend/src/components/dashboard/ActiveIdentitiesCard.tsx": "Card displaying team members with avatars and roles, allowing individual access revocation with toast notifications.",
  "frontend/src/components/dashboard/ActivePlanCard.tsx": "Static card displaying the current subscription plan (Sovereign Enterprise) with crown icon and description.",
  "frontend/src/components/dashboard/AssetShieldCard.tsx": "Card with animated currency counter that counts up to a target amount on dashboard initialization and auto-increments periodically to simulate protected asset value.",
  "frontend/src/components/dashboard/ControlPanel.tsx": "Card with toggle switches for Neural Shield and Stealth Mode features, persisting state to sessionStorage and logging events via telemetry context.",
  "frontend/src/components/dashboard/GlobalNodeMap.tsx": "Card with animated canvas visualization showing pulsing global node locations (NYC, London, Tokyo) with emerald glow effects on dark background.",
  "frontend/src/components/dashboard/KPIMetricsRow.tsx": "Displays four KPI metric cards showing secured meetings count, active global nodes, threats neutralized with a bar chart, and a sovereign health score with a radial chart.",
  "frontend/src/components/dashboard/LiveSpectralAnalysis.tsx": "Renders an animated canvas-based waveform visualization that generates realistic spectral data using sine waves and starts animating when the dashboard is initialized.",
  "frontend/src/components/dashboard/NeuralIngestInput.tsx": "Provides a URL input field with verification button for entering and validating secure meeting links, showing loading and verified states.",
  "frontend/src/components/dashboard/Overview.tsx": "Displays a system overview card with security health percentage, network stats (active sessions, neural efficiency), and team access metrics (team members, threats).",
  "frontend/src/components/dashboard/PricingTable.tsx": "Renders three subscription tier cards (FREE, SOVEREIGN CORE, GLOBAL SHIELD) with features and subscribe buttons, managing tier selection via context.",
  "frontend/src/components/dashboard/QuantumInterlinkCard.tsx": "Shows a simple card displaying quantum interlink status with microphone state, latency, and participant count.",
  "frontend/src/components/dashboard/QuickActionsCard.tsx": "Provides quick action buttons for toggling ghost mode and performing tactical exit (logout with full session cleanup).",
  "frontend/src/components/dashboard/SecurityTrafficTrend.tsx": "Displays a line chart showing security traffic volume trends over the last 7 days using Recharts.",
  "frontend/src/components/dashboard/SpectralAnalysisCard.tsx": "Renders a card with an animated canvas displaying a gradient waveform that simulates spectral analysis with a \"SIGNAL: STABLE\" indicator.",
  "frontend/src/components/dashboard/SynopsisEngineCard.tsx": "Displays a card with a loading spinner and message indicating the Synopsis Engine is awaiting a verified meeting link to begin analysis.",
  "frontend/src/components/dashboard/TeamManagement.tsx": "Provides a team member list with status indicators and the ability to revoke access for individual members with toast notifications.",
  "frontend/src/components/dashboard/TeamStatusCard.tsx": "Shows a simple card displaying team members with their current status (active/idle) using status indicator dots.",
  "frontend/src/components/dashboard/TelemetryFeed.tsx": "Displays a scrollable feed of telemetry events from the TelemetryContext with color-coded event types and timestamps.",
  "frontend/src/components/dashboard/VocalHealthCard.tsx": "Renders a circular progress indicator showing vocal health metrics (98.4/100) with an animated SVG gradient ring.",
  "frontend/src/components/dev/PerformanceOverlay.tsx": "A development overlay that displays real-time FPS metrics, toggleable via Ctrl+Shift+F keyboard shortcut, with color-coded performance warnings.",
  "frontend/src/components/effects/BorderBeam.tsx": "Creates an animated gradient beam effect that travels along the border of its container using CSS animations.",
  "frontend/src/components/effects/SovereignOrb.tsx": "Renders a 3D rotating orb with radial gradient and ripple effects on hover, representing a neural core visualization.",
  "frontend/src/components/errors/ErrorBoundary.tsx": "React error boundary component that catches errors and displays a styled error card with options to retry or return home.",
  "frontend/src/components/landing/AuthorityQuote.tsx": "Displays a centered blockquote with decorative styling attributed to the Global Security Institute about digital sovereignty.",
  "frontend/src/components/landing/BentoGridPreview.tsx": "Defines three preview components (AssetShieldPreview, VocalFingerprintPreview, GlobalNodeMapPreview) for the landing page bento grid, displaying animated stats, circular progress indicators, and a global node map visualization.",
  "frontend/src/components/landing/FloatingNodes3D.tsx": "Renders a decorative background with CSS-animated floating geometric shapes (circles and squares) with gradient colors and blur effects, plus a central glow element.",
  "frontend/src/components/landing/HeroSection.tsx": "Main landing page hero section with a two-column layout featuring headline text, CTA buttons, status indicators on the left, and the FloatingNodes3D visualization on the right.",
  "frontend/src/components/layout/BentoCard.tsx": "Reusable card wrapper component with optional BorderBeam effect, backdrop blur, and custom styling for bento grid layouts.",
  "frontend/src/components/layout/DashboardLayout.tsx": "Main dashboard layout component with sidebar navigation, user profile display, subscription tier badges, mobile menu support, and authentication checks. Handles navigation restrictions based on subscription tier.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with four-column grid layout containing brand info, product links, resources, and legal links, plus a bottom bar with copyright and social media icons.",
  "frontend/src/components/MagneticButton.tsx": "Button component with magnetic attraction effect that translates based on mouse position relative to the button with configurable strength and smooth transitions.",
  "frontend/src/components/mobile/BiometricScanner.tsx": "Interactive biometric scanner component supporting fingerprint and face ID modes with animated scanning progress, haptic feedback, and success/error states.",
  "frontend/src/components/neural/AIMirrorStatus.tsx": "Status indicator component showing whether the AI neural proxy is ready or in standby mode with appropriate icons and messaging.",
  "frontend/src/components/neural/NeuralProgress.tsx": "Displays a circular progress indicator with an animated SVG ring showing synthesis progress percentage and a gradient stroke.",
  "frontend/src/components/neural/VocalDropZone.tsx": "Drag-and-drop file upload component that accepts audio files (MP3, WAV, M4A), displays uploaded files with metadata, and shows toast notifications.",
  "frontend/src/components/neural/VoiceHealthDashboard.tsx": "Displays three voice quality metrics (Pitch Stability, Clarity Index, Tone Quality) with icons, percentage values, and gradient progress bars.",
  "frontend/src/components/scheduling/SecurityAuditScheduler.tsx": "Calendar-based booking interface for scheduling security audit calls with date picker, time slot selection, and confirmation functionality.",
  "frontend/src/components/security/DarkWebMonitor.tsx": "Real-time dark web threat monitoring dashboard that generates and displays threats with filtering by type/severity, severity counts, and CSV export capability.",
  "frontend/src/components/sentinel/AcousticMatrixGrid.tsx": "Grid of clickable environment cards (office, jet, airport, etc.) that can be toggled active/inactive for acoustic masking scenarios.",
  "frontend/src/components/sentinel/EnvironmentMixer.tsx": "Audio mixer interface with volume sliders for eight different environment sounds (office, rain, cafe, etc.) with real-time volume control.",
  "frontend/src/components/sentinel/EnvironmentSpoofing.tsx": "Grid of 16 environment audio spoofing options with play/stop toggle functionality and visual feedback for active environments.",
  "frontend/src/components/sentinel/HardwareMimicry.tsx": "Displays fake OS update screens (Windows 11, macOS) in fullscreen overlay mode with close button for hardware mimicry scenarios.",
  "frontend/src/components/sentinel/PacketJitterSimulator.tsx": "A component that simulates network packet jitter with a slider control, displaying audio quality, latency, and packet loss metrics, with a keyboard shortcut (Ctrl+Shift+L) to activate lag simulation.",
  "frontend/src/components/sentinel/PanicProtocol.tsx": "A full-screen overlay component that mimics a Windows 11 update screen with a progress bar, used as a panic mode disguise, dismissible via Ctrl+Shift+Q keyboard shortcut.",
  "frontend/src/components/settings/BandwidthOptimizer.tsx": "A settings component for adjusting streaming quality presets (low/medium/high/ultra) to optimize bandwidth usage, displaying live bandwidth meter and estimated savings.",
  "frontend/src/components/sync/ConnectionLog.tsx": "A terminal-style log viewer that displays WebSocket connection events, authentication messages, and Diffie-Hellman key exchange status with simulated periodic updates.",
  "frontend/src/components/testimonials/TestimonialCard.tsx": "A reusable card component for displaying user testimonials with avatar, name, title, 5-star rating, and quote text.",
  "frontend/src/components/transitions/NeuralScanTransition.tsx": "A full-screen transition component showing an animated neural scan effect with progress bar and AXON logo, completing after reaching 100%.",
  "frontend/src/components/transitions/PageTransition.tsx": "A simple wrapper component that applies a fade-in animation to its children for page transitions.",
  "frontend/src/components/vault/IntelSessionCard.tsx": "A card component displaying meeting session details with collapsible sections for AI analysis (sentiment, cost) and transcript viewing.",
  "frontend/src/components/vault/SubscriptionTierCard.tsx": "A subscription tier card component showing plan name, pricing (monthly/yearly), feature list, and selection state with border beam effect when selected.",
  "frontend/src/components/vault/SubscriptionTiers.tsx": "A subscription management component displaying three tiers (FREE, SOVEREIGN CORE, GLOBAL SHIELD) with monthly/yearly toggle, persisting selection to localStorage and triggering storage events.",
  "frontend/src/components/vault/SubscriptionToggle.tsx": "A toggle switch component for selecting between monthly and yearly billing periods, with a visual indicator showing 20% savings for yearly subscriptions.",
  "frontend/src/components/video/VideoWelcomeWidget.tsx": "A floating video widget with play/pause, minimize/maximize, and close controls that displays an operator briefing video thumbnail with playback simulation.",
  "frontend/src/components/visualizer/NetworkLatencyGlobe.tsx": "A 3D globe visualization using Three.js that displays global network nodes with color-coded latency indicators and animated connection arcs between locations.",
  "frontend/src/components/visualizer/NeuralFrequencyVisualizer.tsx": "A canvas-based audio wave visualizer that renders animated sine waves in blue and purple to simulate real-time frequency analysis.",
  "frontend/src/components/visualizer/WaterfallSpectrogram.tsx": "A canvas-based waterfall spectrogram that continuously scrolls frequency bars downward with green gradient intensity to visualize audio spectrum over time.",
  "frontend/src/contexts/GhostModeContext.tsx": "A React context provider that manages ghost mode state with session storage persistence and provides a toggle function to child components.",
  "frontend/src/contexts/TelemetryContext.tsx": "A React context provider that manages a log of telemetry events with timestamps and severity types, keeping the last 50 events in memory.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useHapticFeedback.ts": "A hook that provides haptic feedback functions (light, medium, heavy) using the browser's vibration API if available.",
  "frontend/src/hooks/useInternetIdentity.ts": "A comprehensive hook and provider for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useKeyboardShortcut.ts": "A hook that listens for keyboard shortcuts by tracking pressed keys and triggering a callback when all specified keys are pressed simultaneously.",
  "frontend/src/hooks/useMousePosition.ts": "React hook that tracks mouse position relative to the center of a referenced HTML element, returning x and y coordinates.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, roles, meeting logs, panic protocol, and admin features using TanStack Query and the actor backend.",
  "frontend/src/hooks/useSubscriptionTier.ts": "React hook managing subscription tiers (free, core, shield) with localStorage persistence and feature unlock flags for Neural Lab, Sentinel Protocol, and Spectral Analysis.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, glassmorphic effects, tactical UI styles, and keyframe animations for floating nodes and page transitions.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page with tabs for user management, audit logs, and system health monitoring, displaying current user profile and role information.",
  "frontend/src/pages/AnalyticsVault.tsx": "Page displaying subscription tiers and archived meeting logs (intel sessions) in a grid layout with loading states and empty state handling.",
  "frontend/src/pages/CommandCenter.tsx": "Main dashboard page with session validation, displaying overview, KPI metrics, neural ingest input, synopsis engine, asset shield, and tier-gated spectral analysis components.",
  "frontend/src/pages/DeviceSync.tsx": "Provides device synchronization interface with QR code display for pairing mobile devices and a connection log component.",
  "frontend/src/pages/DevMetrics.tsx": "Displays system health metrics including cycles balance, heap/stable memory usage, and real-time memory charts with critical threshold alerts and refresh functionality.",
  "frontend/src/pages/LandingPage.tsx": "Main landing page featuring hero section, authority quote, bento grid preview, testimonials, pricing table, and footer with login callback.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity authentication flow, profile setup for new users, and session management with localStorage integration.",
  "frontend/src/pages/MobileBiometric.tsx": "Mobile-specific page displaying biometric scanner component with navigation back to remote control interface.",
  "frontend/src/pages/NeuralLab.tsx": "Voice cloning interface with persona specification input, vocal sample upload, neural synthesis progress tracking, voice health dashboard, and AI mirror status display.",
  "frontend/src/pages/SentinelProtocol.tsx": "Tactical countermeasures dashboard featuring acoustic matrix, panic mode activation, environment spoofing, packet jitter simulation, and hardware mimicry with subscription tier gating.",
  "frontend/src/pages/Settings.tsx": "Settings page containing bandwidth optimizer component for performance tuning.",
  "frontend/src/pages/SignupPage.tsx": "Empty file with no content.",
  "frontend/src/pages/Subscriptions.tsx": "Displays subscription tier selection page with three plans (Free, Sovereign Core, Global Shield) showing pricing, features, and allowing users to switch tiers with toast notifications.",
  "frontend/src/pages/TacticalRemote.tsx": "Mobile-optimized tactical control interface with large buttons for panic mode, lag simulation, environment spoofing, and biometric scanning, featuring haptic feedback and toast notifications.",
  "frontend/src/pages/TeamManagementPage.tsx": "Simple team management page that displays the ActiveIdentitiesCard component for managing team members and access levels.",
  "frontend/src/pages/UnifiedDashboard.tsx": "Main dashboard component with sidebar navigation, subscription tier badges, and conditional rendering of features (Command Center, Neural Lab, Sentinel Protocol, Device Sync, Vault) based on user's subscription tier.",
  "frontend/src/utils/localStorageAuth.ts": "Provides localStorage-based authentication utilities with basic encryption/decryption for user registration, login validation, session management, and subscription tier handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color palette using OKLCH color space with CSS variables, extended theme settings including container, border radius, fonts (Inter/Georgia), and accordion animations. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document tracking a dashboard application with authentication, subscription tiers, and feature components (Spectral Analysis, Asset Shield). Documents a critical store initialization bug causing null reference errors and lists 8 features to fix state management, localStorage persistence, view routing, and component restoration while maintaining glassmorphic dark theme."
}