{
  "backend/main.mo": "Main Motoko actor implementing role-based access control with user profiles, meeting logs, and panic events. Includes authorization mixin, CRUD operations with ownership verification, and admin-only functions for role management and panic event retrieval.",
  "feature_evidence.json": "Feature evidence report documenting logo replacement across landing page, dashboard, PWA manifest, and favicon with high confidence, linked to test REQ-53.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components including routing, hooks, pages, visualizers, and analytics components with details on authentication, state management, and UI features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color tokens for UI components including sidebar, charts, and semantic colors using OKLCH color space.",
  "frontend/index.html": "Root HTML template with PWA manifest link, favicon reference to aegis-favicon.dim_32x32.png, and module script entry point for React application.",
  "frontend/public/manifest.json": "PWA manifest defining Aegis Sovereign Remote app metadata with standalone display mode, portrait orientation, and icon references to aegis-icon-192 and aegis-icon-512 PNG files.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with public and protected routes, GhostModeProvider, panic protocol keyboard shortcut (Ctrl+Shift+P), theme provider, and role-based route guards for admin features.",
  "frontend/src/components/analytics/BiometricStressRadar.tsx": "Recharts radar chart displaying five biometric metrics (Executive Stress, Vocal Stability, Background Noise, Packet Health, Privacy Score) with live data updates every 4 seconds and active status indicator.",
  "frontend/src/components/analytics/GlobalNodeMap.tsx": "SVG-based world map visualization showing four global nodes (San Francisco, London, Tokyo, Bangalore) with animated pulse effects on random node activation every 3 seconds.",
  "frontend/src/components/analytics/MeetingLogCard.tsx": "Displays a card with meeting details including title, duration, participant count, sentiment score, and cost. Shows an encrypted lock icon and formats duration in minutes and seconds.",
  "frontend/src/components/analytics/MeetingROITicker.tsx": "Live meeting cost tracker that increments by ₹12.5 per second with pause/resume functionality. Displays current cost and rate with an active status indicator.",
  "frontend/src/components/analytics/NeuralPacketStream.tsx": "Real-time scrolling log display showing simulated security events across categories (ENCRYPT, PACKET, NEURAL, QUANTUM). Generates random log entries every 2-3 seconds and maintains last 50 entries.",
  "frontend/src/components/analytics/SentimentRadar.tsx": "Live area chart displaying vocal stress and emotional tension metrics over time. Updates every 3 seconds with random data points and maintains a 21-point rolling window.",
  "frontend/src/components/analytics/SpeakerIdentityMatrix.tsx": "Displays a list of speakers with their vocal frequency ranges and activity levels. Activity percentages update every 3 seconds with animated progress bars.",
  "frontend/src/components/analytics/SystemAuditTrail.tsx": "Scrolling terminal-style log viewer showing security events across categories (ENCRYPT, SENSORY, AUTH, NETWORK, BIOMETRIC, PACKET). Generates logs every 2-3 seconds and keeps last 50 entries.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to login page. Shows loading spinner during initialization and authentication, wraps children in ErrorBoundary.",
  "frontend/src/components/auth/RoleProtectedRoute.tsx": "Role-based access control component that verifies user permissions (admin or user) and redirects to dashboard if access denied. Shows loading state during permission verification.",
  "frontend/src/components/common/ActiveStatusIndicator.tsx": "Small animated green dot indicator with pulsing effect and tooltip showing \"Status: Active\". Used to indicate live/active state in various components.",
  "frontend/src/components/effects/BorderBeam.tsx": "Animated border effect component that creates a moving gradient beam along the border using CSS animations. Applies a diagonal sweep animation over 8 seconds.",
  "frontend/src/components/effects/SovereignOrb.tsx": "3D rotating orb visualization with radial gradient and glow effects. Shows ripple animations on hover and continuously rotates using CSS 3D transforms.",
  "frontend/src/components/errors/ErrorBoundary.tsx": "React error boundary component that catches errors in child components and displays a styled error card with options to retry or return home.",
  "frontend/src/components/layout/BentoCard.tsx": "Reusable card component with glassmorphism styling and optional animated border beam effect for bento-style layouts.",
  "frontend/src/components/layout/DashboardLayout.tsx": "Main dashboard layout component with collapsible sidebar navigation, role-based access control, ghost mode toggle, and user profile display with loading states.",
  "frontend/src/components/MagneticButton.tsx": "Button component with magnetic attraction effect that translates position based on mouse proximity using useMousePosition hook with 0.3 strength multiplier.",
  "frontend/src/components/neural/AIMirrorStatus.tsx": "Status indicator component showing whether the AI voice twin (neural proxy) is ready or in standby mode with appropriate icons and messages.",
  "frontend/src/components/neural/NeuralProgress.tsx": "Circular progress indicator with SVG gradient ring displaying synthesis progress percentage for neural processing tasks.",
  "frontend/src/components/neural/VocalDropZone.tsx": "Drag-and-drop file upload component for audio files that validates file types and displays uploaded audio file list with metadata.",
  "frontend/src/components/neural/VoiceHealthDashboard.tsx": "Dashboard displaying voice quality metrics (pitch stability, clarity index, tone quality) with progress bars and gradient styling.",
  "frontend/src/components/sentinel/EnvironmentMixer.tsx": "Audio environment mixer with volume sliders for eight different ambient sound environments (office, rain, cafe, etc.) for tactical audio masking.",
  "frontend/src/components/sentinel/EnvironmentSpoofing.tsx": "Grid of 16 clickable environment presets that can be activated to spoof background audio with play/stop controls and visual feedback.",
  "frontend/src/components/sentinel/HardwareMimicry.tsx": "Component that displays fake OS update screens (Windows 11 or macOS) in fullscreen overlay mode for hardware mimicry purposes.",
  "frontend/src/components/sentinel/PacketJitterSimulator.tsx": "Network degradation simulator with slider control to adjust audio quality, latency, and packet loss, includes Ctrl+Shift+L keyboard shortcut.",
  "frontend/src/components/sentinel/PanicProtocol.tsx": "Displays a fake Windows 11 update screen as a panic mode overlay with a progress bar and a hidden keyboard shortcut (Ctrl+Shift+Q) to dismiss it.",
  "frontend/src/components/sync/ConnectionLog.tsx": "Renders a terminal-style connection log with simulated WebSocket messages that update every 5 seconds, displaying timestamps and color-coded log entries.",
  "frontend/src/components/transitions/PageTransition.tsx": "Simple wrapper component that applies a fade-in animation to its children for page transitions.",
  "frontend/src/components/visualizer/NeuralFrequencyVisualizer.tsx": "Canvas-based audio wave visualizer that renders two animated sine waves with different frequencies and colors, including an active status indicator.",
  "frontend/src/components/visualizer/WaterfallSpectrogram.tsx": "Canvas-based waterfall spectrogram that displays scrolling frequency bars with neon green gradient, simulating real-time audio frequency analysis.",
  "frontend/src/contexts/GhostModeContext.tsx": "React context provider that manages ghost mode state with sessionStorage persistence and provides toggle functionality.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages ICP backend actor creation with Internet Identity authentication, admin token initialization, and automatic query invalidation on identity changes.",
  "frontend/src/hooks/useHapticFeedback.ts": "Hook providing haptic feedback functions (light, medium, heavy) using the browser's vibration API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive Internet Identity authentication hook and provider for ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useKeyboardShortcut.ts": "Hook that listens for specific keyboard shortcut combinations (including modifier keys) and triggers a callback when all keys are pressed.",
  "frontend/src/hooks/useMousePosition.ts": "Hook that tracks mouse position relative to the center of a referenced element, returning x and y coordinates.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for ICP backend operations including user profiles, roles, admin checks, meeting logs, and panic event management with automatic cache invalidation.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives, defines CSS custom properties for theming (light/dark modes with color variables for UI components), and includes utility classes and animations.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page that displays user management interface with a table showing the current user's profile, role, and status; includes notes about requiring backend implementation for full user listing functionality.",
  "frontend/src/pages/AnalyticsVault.tsx": "Analytics vault page that fetches and displays meeting logs in a grid of cards, showing a loading skeleton during fetch or an empty state when no meetings exist.",
  "frontend/src/pages/CommandCenter.tsx": "Main dashboard page displaying a comprehensive grid layout of real-time meeting intelligence components including visualizers, analytics widgets, sentiment radar, ROI ticker, and system monitoring tools.",
  "frontend/src/pages/DeviceSync.tsx": "Device synchronization page that displays a QR code for mobile pairing and a connection log, enabling users to pair mobile devices for remote control.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, security architecture features, pricing tiers, and social links; includes navigation to login/signup pages.",
  "frontend/src/pages/LoginPage.tsx": "Login page that provides Internet Identity authentication with a centered card UI, redirecting to dashboard upon successful authentication.",
  "frontend/src/pages/NeuralLab.tsx": "Neural lab page for vocal cloning and synthesis featuring file upload, progress tracking, voice health dashboard, and AI mirror status with simulated synthesis processing.",
  "frontend/src/pages/SentinelProtocol.tsx": "Sentinel Protocol page displaying tactical countermeasures including emergency panic button, environment mixer, environment spoofing, packet jitter simulator, and hardware mimicry components in a bento grid layout with tactical HUD background.",
  "frontend/src/pages/SignupPage.tsx": "Signup page component that handles user registration via Internet Identity authentication, creates user profile with username, and redirects to dashboard upon successful account creation.",
  "frontend/src/pages/TacticalRemote.tsx": "Mobile-optimized tactical remote interface with large touch-friendly buttons for panic mode, lag simulation, and environment spoofing, featuring haptic feedback and toast notifications.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, extended theme with sidebar/chart colors, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document defining Aegis Sovereign as an enterprise meeting intelligence suite on ICP with architectural notes covering tech stack (React, Motoko, Tailwind), multi-page architecture, glassmorphism design, and extensive feature list including authentication, dashboards, and tactical components."
}