{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix store initialization error and restore dashboard components",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add null-check guard in global state store initialization to prevent '__store' null reference errors",
      "acceptanceCriteria": [
        "Store initialization includes explicit null check before any component render",
        "Default tier is 'free' when store is re-initialized",
        "User profile defaults to empty object structure",
        "No '__store' null reference errors occur during app initialization"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSubscriptionTier.ts",
          "operation": "modify",
          "description": "Add null-check guard at the beginning of the useSubscriptionTier hook. If '__store' or tier state is null/undefined, immediately re-initialize with default values: subscription tier 'free' and empty user profile object. Ensure this validation runs before any component attempts to access the store."
        },
        {
          "path": "frontend/src/utils/localStorageAuth.ts",
          "operation": "modify",
          "description": "Add defensive null checks in all functions that access localStorage. If AXON_MASTER_USER or related keys return null, initialize with default structure including 'free' tier and empty profile before proceeding."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Force-reset application view to 'homepage-view' as primary entry point",
      "acceptanceCriteria": [
        "App.tsx initializes with 'homepage-view' as the default view",
        "No other view attempts to render before homepage is ready",
        "View state correctly persists and transitions to login/dashboard when appropriate"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Set the initial view state to 'homepage-view' as the default starting state. Ensure the view hierarchy respects this default before checking session storage or other persistence mechanisms. Validate that no conditional logic bypasses this default during initial render."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Re-bind 'Start Journey' button to properly trigger login portal overlay",
      "acceptanceCriteria": [
        "'Start Journey' button click transitions view from 'homepage-view' to 'login'",
        "Login overlay displays correctly after button click",
        "No console errors during view transition"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Verify and re-bind the 'Start Journey' button click handler to properly invoke the onShowLogin callback prop, ensuring it transitions the view state to 'login' correctly. Test that the handler properly communicates with App.tsx's view management."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Repair localStorage persistence for User Name and Subscription Tier",
      "acceptanceCriteria": [
        "User name is correctly saved to localStorage on authentication",
        "Subscription tier is correctly saved to localStorage on tier selection or initialization",
        "Values persist across page refreshes",
        "Values are correctly retrieved during session restoration"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/localStorageAuth.ts",
          "operation": "modify",
          "description": "Review and repair all localStorage.setItem and localStorage.getItem calls for AXON_MASTER_USER key. Ensure user name and subscription tier are correctly saved during authentication flow and properly retrieved during session restoration. Verify encryption/decryption logic preserves data integrity."
        },
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Ensure localStorage persistence calls are correctly invoked after successful authentication. Verify that user name from profile setup and subscription tier are both saved via localStorageAuth utility functions."
        },
        {
          "path": "frontend/src/hooks/useSubscriptionTier.ts",
          "operation": "modify",
          "description": "Verify localStorage sync for subscription tier changes. Ensure tier updates trigger localStorage persistence and that the hook correctly reads persisted values on initialization."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Ensure dashboard view remains hidden when user is not logged in",
      "acceptanceCriteria": [
        "Dashboard only renders when user authentication state is valid",
        "Unauthenticated users see homepage or login view, never dashboard",
        "No store access errors occur when user is not logged in"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add conditional check that prevents dashboard view rendering if authentication state is invalid. Ensure the view logic validates session state before allowing transition to 'dashboard'. If validation fails, redirect to 'homepage-view' or 'login'."
        },
        {
          "path": "frontend/src/pages/CommandCenter.tsx",
          "operation": "modify",
          "description": "Add early return or authentication guard at the top of the component. Prevent rendering and store access if user authentication is not confirmed. Show loading state or redirect to login if unauthenticated."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Re-inject LiveSpectralAnalysis component into Command Center dashboard",
      "acceptanceCriteria": [
        "LiveSpectralAnalysis component is present in the Command Center dashboard",
        "Component only renders after store validation succeeds",
        "Spectral animation displays correctly",
        "Component respects subscription tier access controls"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CommandCenter.tsx",
          "operation": "modify",
          "description": "Re-inject the LiveSpectralAnalysis component into the Command Center layout after store validation succeeds. Use the existing subscription tier hook to conditionally render based on tier. Place the component in the dashboard grid where it appeared in previous stable versions."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Re-inject AssetShieldCard component into Command Center dashboard",
      "acceptanceCriteria": [
        "AssetShieldCard component is present in the Command Center dashboard",
        "Component only renders after store validation succeeds",
        "Animated counter displays protected assets value correctly",
        "Component respects subscription tier access controls"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CommandCenter.tsx",
          "operation": "modify",
          "description": "Re-inject the AssetShieldCard component into the Command Center layout after store validation succeeds. Ensure the animated counter initializes correctly and displays the protected assets value. Place alongside LiveSpectralAnalysis in the dashboard grid."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Maintain high-end dark theme with glassmorphic UI styling throughout restored components",
      "acceptanceCriteria": [
        "Dark theme colors remain consistent across all restored components",
        "Glassmorphic effects (backdrop blur, transparency) are present",
        "Scanline overlays and tactical aesthetics are preserved",
        "Visual consistency matches previous stable version"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Review and ensure global CSS variables, glassmorphic effects, scanlines, and tactical UI styling are properly defined and not overridden. Verify dark theme consistency across the application."
        },
        {
          "path": "frontend/src/components/dashboard/LiveSpectralAnalysis.tsx",
          "operation": "modify",
          "description": "Ensure the component maintains glassmorphic card styling, dark theme colors, gradient effects, and scanline overlays consistent with the tactical aesthetic from previous stable versions."
        },
        {
          "path": "frontend/src/components/dashboard/AssetShieldCard.tsx",
          "operation": "modify",
          "description": "Verify the component uses glassmorphic styling with backdrop blur, dark theme colors, and gradient accents matching the high-end tactical UI aesthetic from previous stable versions."
        }
      ]
    }
  ]
}