{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Redesign Dashboard to Match Reference Application",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Transform CommandCenter page layout to match reference application's grid structure, card arrangements, and spacing",
      "acceptanceCriteria": [
        "Dashboard layout matches the reference application's grid structure",
        "Card components are arranged in the same visual hierarchy as the reference",
        "Spacing and proportions align with the reference design"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CommandCenter.tsx",
          "operation": "modify",
          "description": "Restructure the CommandCenter component to match the reference application's grid layout. Replace the current three-section layout (Overview, KPI row, grid of cards) with a new grid structure that matches the reference's visual hierarchy. Update container classes, grid configurations (columns, gaps, responsive breakpoints), and card placement to align with the reference design. Maintain existing component imports and functionality while reorganizing their placement and sizing."
        },
        {
          "path": "frontend/src/components/dashboard/Overview.tsx",
          "operation": "modify",
          "description": "Adjust the Overview card's dimensions, padding, and internal grid layout to match its position and size in the reference application. Update spacing between metric items and ensure responsive behavior matches the reference."
        },
        {
          "path": "frontend/src/components/dashboard/KPIMetricsRow.tsx",
          "operation": "modify",
          "description": "Modify the KPI metrics grid structure to match the reference application's card arrangement. Adjust grid columns, gap spacing, and card proportions to align with the reference layout."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update color scheme and visual theming to match reference application's aesthetic including card backgrounds, text colors, and accent colors",
      "acceptanceCriteria": [
        "Color scheme matches the reference application",
        "Card styling and backgrounds align with reference design",
        "Text hierarchy and typography match the reference"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update CSS custom properties and color variables to match the reference application's color palette. Modify background colors, text colors, accent colors (currently emerald-based), border colors, and shadow definitions. Adjust the tactical glass effect styling to match the reference's card backgrounds. Update color values in both light and dark theme sections to ensure consistency with the reference design."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Update Tailwind theme configuration to match the reference application's color system. Modify custom color definitions in the extend.colors section to align with the reference palette. Adjust primary, secondary, accent, and utility color values using OKLCH color space to match the reference aesthetic."
        },
        {
          "path": "frontend/src/components/layout/BentoCard.tsx",
          "operation": "modify",
          "description": "Update the BentoCard component's glassmorphism styling to match the reference application's card background treatment. Adjust background opacity, blur values, border styling, and shadow effects to align with the reference design."
        },
        {
          "path": "frontend/src/components/common/MetricCard.tsx",
          "operation": "modify",
          "description": "Update MetricCard component styling to match the reference application's metric presentation. Adjust text colors, icon colors (currently emerald), background treatments, and trend indicator styling to align with the reference color scheme."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Redesign dashboard cards (KPIMetricsRow, NeuralIngestInput, SynopsisEngineCard, SpectralAnalysisCard) to match reference application's content structure and visual presentation",
      "acceptanceCriteria": [
        "Each card component's content and layout matches its counterpart in the reference",
        "Card interactions and animations align with reference behavior",
        "Data visualization components match the reference style"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/NeuralIngestInput.tsx",
          "operation": "modify",
          "description": "Redesign the NeuralIngestInput card to match the reference application's equivalent input component. Update the card's internal layout, input field styling, button placement, and visual feedback mechanisms. Adjust spacing, typography, and interactive states (hover, focus, loading) to align with the reference design while maintaining the existing URL verification functionality."
        },
        {
          "path": "frontend/src/components/dashboard/SynopsisEngineCard.tsx",
          "operation": "modify",
          "description": "Redesign the SynopsisEngineCard to match the reference application's equivalent status/loading component. Update the loading spinner styling, message presentation, and overall card layout to match the reference design. Adjust typography, icon styling, and animation effects to align with the reference aesthetic."
        },
        {
          "path": "frontend/src/components/dashboard/SpectralAnalysisCard.tsx",
          "operation": "modify",
          "description": "Redesign the SpectralAnalysisCard canvas visualization to match the reference application's equivalent data visualization component. Update the canvas drawing style, wave form appearance, color scheme (currently using emerald gradient), animation parameters, and card wrapper styling to align with the reference design."
        },
        {
          "path": "frontend/src/components/dashboard/KPIMetricsRow.tsx",
          "operation": "modify",
          "description": "Redesign the individual metric cards within KPIMetricsRow to match the reference application's metric presentation style. Update chart visualizations (bar chart for threats, radial gauge for health score), metric value formatting, label styling, and icon treatments to align with the reference design."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update DashboardLayout sidebar navigation to match reference application's navigation structure, icons, and visual styling",
      "acceptanceCriteria": [
        "Sidebar navigation structure matches the reference",
        "Navigation icons and labels align with reference design",
        "Active state styling matches the reference application"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/DashboardLayout.tsx",
          "operation": "modify",
          "description": "Redesign the sidebar navigation section to match the reference application's navigation structure and styling. Update navigation item arrangement, icon selections, label text formatting, spacing between items, and active state indicators. Adjust sidebar width, background styling, and hover effects to align with the reference design. Update the mobile menu implementation to match the reference's mobile navigation behavior. Maintain existing routing functionality and subscription tier-based feature gating while applying the new visual style."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Adjust responsive behavior and mobile layout to match reference application's screen size handling and breakpoints",
      "acceptanceCriteria": [
        "Responsive breakpoints match the reference application",
        "Mobile layout and stacking order align with reference",
        "Touch interactions work consistently with reference"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CommandCenter.tsx",
          "operation": "modify",
          "description": "Update responsive breakpoint classes and mobile-specific layout adjustments to match the reference application's behavior. Modify grid column configurations for different screen sizes (sm, md, lg, xl breakpoints), adjust card stacking order on mobile, and ensure proper spacing at all breakpoints to align with the reference design."
        },
        {
          "path": "frontend/src/components/layout/DashboardLayout.tsx",
          "operation": "modify",
          "description": "Update responsive behavior for sidebar collapse/expansion, mobile menu transitions, and touch interactions to match the reference application. Adjust breakpoint-specific styling and ensure mobile navigation patterns align with the reference design."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Review and adjust responsive breakpoint definitions if needed to match the reference application's screen size thresholds. Ensure breakpoint values align with the reference design system."
        }
      ]
    }
  ]
}